{
  "backend/main.mo": "Main IC canister actor handling user profiles, invite codes, access control, vehicle records, notifications, and admin-allowlist logic via authorization and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related frontend files, components, and test IDs for recent admin-onboarding and routing changes.",
  "frontend-file-summaries.txt": "Collection of short summaries describing various frontend components, hooks, pages, and infrastructure utilities across the project.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global background and text styles.",
  "frontend/index.html": "HTML entry file setting metadata, PWA manifest links, icons, and loading the React app via main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, colors, icons, categories, and startup behavior for the Pasar Digital Community app.",
  "frontend/public/sw.js": "Service worker implementing cache-first and network-first strategies with explicit non-cacheable assets and versioned cache cleanup.",
  "frontend/src/App.tsx": "Main React app routing configuration using TanStack Router, with I18nProvider, ThemeProvider, and route definitions for all major pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message and allows eligible users to claim first admin privileges by submitting profile info.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Shows detailed profile loading errors, categorized causes, and provides error copy and retry options.",
  "frontend/src/components/auth/SignInScreen.tsx": "Presents a branded login screen enabling users to sign in via Internet Identity.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Displays startup initialization errors with troubleshooting steps and a retry button.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo at configurable sizes.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Provides a dropdown to switch between available interface languages.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with authenticated header, footer, and layout structure.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost with a required note and mutation call.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for submitting a found vehicle report tied to a specific vehicle.",
  "frontend/src/components/nav/AppHeader.tsx": "Renders the main navigation header with user menu, language switcher, and conditional admin links based on admin status.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Catches top-level rendering errors and displays a fallback UI instead of crashing.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Displays an error screen with troubleshooting steps and a reload button when the app hits a critical error.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Handles initiating a vehicle transfer, prompting for PIN and showing the generated transfer code with copy functionality.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "A dialog that collects and submits a PIN with error handling and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Provides loading and error status for actor initialization with a retry mechanism that clears and refreshes the actor query.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for checking admin status, onboarding first admin, and fetching admin-only data using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks for querying lost vehicles and marking vehicles lost or found, with cache invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Hooks for fetching user notifications with polling and marking notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Mutation hook to complete user onboarding and refresh the current user profile.",
  "frontend/src/hooks/usePin.ts": "Hooks for setting up and updating a user's PIN via actor calls.",
  "frontend/src/hooks/useProfile.ts": "Hooks for fetching and saving the caller’s user profile, keyed by the current identity.",
  "frontend/src/hooks/useTransfers.ts": "Hooks to initiate and accept vehicle transfers and refresh related queries.",
  "frontend/src/hooks/useVehicles.ts": "Hooks for fetching user vehicles, fetching a specific vehicle, and registering new vehicles.",
  "frontend/src/i18n/i18n.ts": "Implements a lightweight i18n system with language registration, translation lookup, and listeners.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides an i18n context for managing language state, translations, and available languages.",
  "frontend/src/i18n/languages/ar.ts": "Arabic language pack defining translations and RTL settings.",
  "frontend/src/i18n/languages/en.ts": "Provides English language translations for navigation, dashboard, vehicle management, and authentication UI text.",
  "frontend/src/i18n/languages/id.ts": "Provides Indonesian translations for the application's UI, mirroring keys used across navigation, dashboard, and vehicle flows.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Contains Simplified Chinese translations for all major UI elements including dashboard, vehicles, and registration screens.",
  "frontend/src/i18n/storage.ts": "Handles saving and loading the selected language code using localStorage with error safety.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes, including color tokens and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page describing the platform, its features, and provides admin contact information.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Implements a form for users to enter and submit a vehicle transfer code, handling validation and transfer acceptance.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin-only dashboard showing system statistics and handling admin access verification.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin interface for generating, listing, and managing invite tokens with copy-to-clipboard support.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing user vehicle stats, lost vehicle reports, and unread notifications with quick navigation actions.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Lists reported lost vehicles with search and filtering, displaying details and allowing found reports.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications with timestamps and allows marking them as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles invite-based onboarding form submission and redirects admins away from the page.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits user profile information with support for updating and logging out.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form for registering a new vehicle, including photo upload with progress and submission handling.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Provides UI and logic for creating and updating a security PIN with validation and toast feedback.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information for a specific vehicle, including status, photo, metadata, and owner actions.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists the user's registered vehicles with status badges and navigation to vehicle registration or detail pages.",
  "frontend/src/routes/RootRouteGate.tsx": "Handles authentication, profile/admin loading, onboarding redirects, and actor bootstrap errors before rendering the main app layout.",
  "frontend/src/utils/actorProxy.ts": "Wraps backend actors to safely handle admin secret initialization and prevent startup failures from invalid tokens.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a stable React Query key for actor-related queries based on identity.",
  "frontend/src/utils/adminAllowlist.ts": "Provides a client-side allowlist of admin principals and helpers to check or retrieve them.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, extracts technical details, and formats them for display or copying.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and enabled plugins.",
  "project_state.json": "Describes current project state, known issues, admin allowlist needs, and feature requests related to onboarding and authorization."
}