{
  "backend/main.mo": "Main Motoko canister implementing authorization mixins, invite codes, user onboarding, profiles, vehicles, notifications, and admin-restricted actions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base setup defining light and dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and loading the main React script.",
  "frontend/public/manifest.webmanifest": "PWA manifest containing app metadata, icons, theme colors, and language configuration.",
  "frontend/public/sw.js": "Service worker implementing basic caching, fetch handling, and cache cleanup for offline support.",
  "frontend/src/App.tsx": "Main React app routing and authentication gate setup using TanStack Router and profile loading logic.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message and optionally allows eligible users to claim first admin access through a form.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Shows a detailed error screen when loading a user's profile fails, with retry options and troubleshooting hints.",
  "frontend/src/components/auth/SignInScreen.tsx": "Presents the Internet Identity login screen with app branding and security feature highlights.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo at variable sizes for branding use across the UI.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with header and footer layout logic, showing navigation only for authenticated and onboarded users.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Provides a dialog for reporting a vehicle as lost, submitting a required description to the backend.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for reporting a lost vehicle as found, collecting a required finder report and submitting it.",
  "frontend/src/components/nav/AppHeader.tsx": "Renders the main navigation header with dynamic menu items, user dropdown, admin links, and logout handling.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Component to initiate a vehicle ownership transfer, prompting for a PIN and generating a shareable transfer code link.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Modal dialog that collects a user's PIN and handles submission errors and loading state.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Hooks for admin-related actions such as checking admin status, onboarding the first admin, managing invite codes, and retrieving system stats or registered vehicles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks to fetch lost vehicles and mutate their lost/found state while invalidating related queries.",
  "frontend/src/hooks/useNotifications.ts": "Hooks for retrieving user notifications with polling and marking them as read.",
  "frontend/src/hooks/useOnboarding.ts": "Hook to complete user onboarding and refresh the profile query.",
  "frontend/src/hooks/usePin.ts": "Hooks for setting up or updating a user's PIN via backend calls.",
  "frontend/src/hooks/useProfile.ts": "Hooks for getting the caller's profile based on role detection and a placeholder, plus a stub for unsupported profile saving.",
  "frontend/src/hooks/useTransfers.ts": "Hooks to initiate or accept vehicle ownership transfers while refreshing impacted queries.",
  "frontend/src/hooks/useVehicles.ts": "Provides React Query hooks to fetch a user's vehicles, fetch a specific vehicle, and register a new vehicle with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page describing the app, features, and admin contact info.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Handles accepting a vehicle transfer via a transfer code with validation and mutation logic.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin system stats, handles admin validation, and provides navigation to admin management pages.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Allows admins to view, generate, and manage invite tokens with copy-to-clipboard and usage tracking.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user statistics, quick actions, and system info using various data-fetching hooks.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Shows a searchable list of reported lost vehicles with filtering and detail cards.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications and allows marking individual notifications as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "A form page for completing onboarding using an invite token and basic profile details, then submitting to the backend and navigating home on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the logged-in user's profile and Internet Identity info, with read-only onboarding data and a logout action.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a vehicle registration form including photo upload with progress tracking and submits data to create a new vehicle entry.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Allows users to create or update a PIN for securing vehicle ownership transfers, with validation and mutation hooks.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed information for a specific vehicle, including photo, status badges, ownership checks, and transfer/lost actions.",
  "frontend/src/pages/VehiclesPage.tsx": "Renders the user's vehicles list with status badges, loading states, and navigation to registration or vehicle details.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin integration for the frontend.",
  "project_state.json": "Defines current project state, requirements, architecture notes, issues, and implemented features for the Pasar Digital Community app. Used as a central specification snapshot for build planning and debugging."
}