{
  "backend/main.mo": "Main Motoko canister defining user profiles, vehicles, notifications, permissions, activation tokens, and helper methods for access control and onboarding.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs with high-level metadata.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional descriptions of components, pages, and hooks.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and hook rules with custom warnings and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier formatting configuration specifying spacing, quotes, print width, and other style rules.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Defines protected interfaces and required review steps for modifying routes, auth flow, backend API, and data schemas.",
  "frontend/CHANGELOG.md": "Project changelog documenting releases, added features, changes, and protected interfaces for version 1.0.0.",
  "frontend/ci-run-gates.sh": "Shell script running all frontend quality gates via npm for CI pipelines.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base styling.",
  "frontend/index.html": "HTML entry point that loads the PWA manifest, icons, and mounts the React app.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist enforcing change‑control rules, quality gates, testing, and documentation requirements.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, language, and display settings.",
  "frontend/public/sw.js": "Service worker implementing caching strategies for static assets and network‑first behavior for HTML.",
  "frontend/QUALITY_GATES.md": "Documentation describing the automated quality gates and how to run them.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how to follow the project’s change-control process during development.",
  "frontend/README_VERSIONING.md": "Semantic versioning guide describing how to manage and update the project version.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up React Router routes, React Query client, and global providers including InternetIdentity.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card for checking activation status and redeeming activation tokens for vehicle registration.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with navigation back to the dashboard and admin info.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Error screen showing profile‑loading failures with backend health diagnostics and copy‑to‑clipboard support.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign‑in page using Internet Identity with branding and feature highlights.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Error screen handling startup bootstrap failures with retry logic and health diagnostics.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo in configurable sizes.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder file for a language switcher component.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper handling header visibility, authentication state, and footer rendering.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned with note submission.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog allowing users to submit a found-vehicle report with details.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with user menu, navigation links, and admin detection.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary catching unexpected render errors and displaying a fallback component.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "UI for handling top-level errors with reload instructions.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to initiate vehicle ownership transfer, requiring PIN verification and generating a transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "PIN entry dialog with validation, error handling, and submit workflow.",
  "frontend/src/components/vehicle/VehiclePhotoSection.tsx": "Displays a vehicle photo with fallback UI if the image fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actors tied to user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap errors with timed retries and continuous retry for stopped canisters.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations including admin checks, invite codes, activation tokens, and system stats.",
  "frontend/src/hooks/useBackendHealth.ts": "Performs periodic anonymous health checks against the backend and reports reachability and diagnostics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations to mark vehicles lost or found with query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Fetches user notifications with polling and provides a mutation to mark notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Runs onboarding mutation with detailed logging, error normalization, and cache invalidation on success.",
  "frontend/src/hooks/usePin.ts": "React Query hooks for checking, setting, and updating a user's PIN via the actor API.",
  "frontend/src/hooks/useProfile.ts": "Hooks to fetch and save the caller's user profile with cache invalidation.",
  "frontend/src/hooks/useTransfers.ts": "Provides mutations to initiate and accept vehicle ownership transfers and refresh related queries.",
  "frontend/src/hooks/useVehicleCheck.ts": "Mutation hook that checks vehicle status by engine number using the actor API.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Hooks for checking registration activation status and redeeming activation tokens with error handling.",
  "frontend/src/hooks/useVehicles.ts": "Hooks for listing, fetching, registering, and revoking ownership of vehicles with query invalidation.",
  "frontend/src/i18n/i18n.ts": "Empty file intended for global i18n configuration.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file placeholder for an i18n provider component.",
  "frontend/src/i18n/languages/ar.ts": "Empty Arabic translation file placeholder.",
  "frontend/src/i18n/languages/en.ts": "Empty English translation file placeholder.",
  "frontend/src/i18n/languages/id.ts": "Empty Indonesian translation file placeholder.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty Simplified Chinese translation file placeholder.",
  "frontend/src/i18n/storage.ts": "Empty file intended for i18n language storage utilities.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and global styles.",
  "frontend/src/main.tsx": "Application entry point initializing React Query, Internet Identity, and rendering the app.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Test file placeholder with no implemented tests.",
  "frontend/src/pages/AboutPage.tsx": "Static page describing the app, its features, and admin contact information.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page for entering and submitting a vehicle transfer code with validation and feedback.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin-only dashboard showing system stats and handling admin access verification and error states.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page that verifies admin status and lets admins generate, copy, and share user activation tokens with UI feedback and error handling.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing vehicle counts, notifications, and quick navigation actions.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays and filters reported lost, stolen, or pawned vehicles with search and status details.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows user notifications and allows marking them as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles user onboarding, collecting profile info and optionally setting up the first admin account.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile viewing and editing, logout, and PIN creation or updates.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a new vehicle, including photo upload and activation checks.",
  "frontend/src/pages/ReportFoundVehiclePage.tsx": "Allows users to check a vehicle by engine number and submit found-vehicle reports based on status.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Provides UI and logic for creating and updating a user PIN using form validation and mutation hooks.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Allows users to check a vehicle by engine number and displays status badges, alerts, photos, and report options.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed vehicle info, status, transfer options, and handles ownership revocation with PIN verification.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists the user's vehicles with status badges and provides registration access based on activation state.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Placeholder test file for RootRouteGate with no implemented tests.",
  "frontend/src/routes/RootRouteGate.tsx": "Routing gate that manages login state, profile loading, bootstrap retry logic, and redirects users to onboarding or the app layout.",
  "frontend/src/test/setup.ts": "Test setup file currently empty.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Placeholder test file for bootstrap error utilities with no implemented tests.",
  "frontend/src/utils/actorProxy.ts": "Creates a safe proxy around backend actors to gracefully handle admin token initialization errors and avoid startup traps.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a canonical React Query key for actor-related queries using the caller’s principal.",
  "frontend/src/utils/adminAllowlist.ts": "Defines a client-side admin allowlist and exposes helpers to check and retrieve allowlisted admin principals.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, detects stopped canisters, extracts technical details, and provides user guidance messages.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes backend actor errors into user-facing messages and categorizes them by type with context-specific handling.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty utility module reserved for onboarding troubleshooting helpers.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read, persist, and clear URL parameters and session parameters, including hash-based routing support.",
  "frontend/src/version.ts": "Defines the application’s version number and build date as the single source of truth.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and container settings for the frontend.",
  "frontend/vitest.config.ts": "Vitest config file exists but is currently empty.",
  "project_state.json": "Defines the project’s current state and requirements, focusing on adding a PIN‑verified vehicle ownership revocation feature without affecting existing functionality."
}