{
  "backend/main.mo": "Main Motoko actor implementing user profiles, vehicle records, notifications, activation tokens, permissions, and invite code generation with multiple authorization and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing affected files, components, and test IDs for two frontend fixes regarding vehicle listing consistency and error handling.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files including hooks, pages, components, and PWA setup.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and React Hooks rules with custom warning settings and ignore patterns.",
  "frontend/.prettierrc.json": "Prettier configuration specifying formatting rules such as semicolons, print width, quotes, and tab size.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Change control policy defining protected interfaces, backend API rules, verification steps, and mandatory review requirements.",
  "frontend/CHANGELOG.md": "Project changelog documenting PWA support, recent feature additions, and prior release history following semantic versioning.",
  "frontend/ci-run-gates.sh": "Shell script to run frontend quality gates via npm from the CI pipeline.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Base HTML document configuring metadata, PWA icons, and root mounting point.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist enforcing change control, quality gates, testing steps, and documentation requirements.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, start URL, icons, and categories.",
  "frontend/public/sw.js": "Service worker handling caching strategy, asset caching, and versioned cache cleanup.",
  "frontend/QUALITY_GATES.md": "Documentation explaining the automated quality gates system and how to run it.",
  "frontend/README_CHANGE_CONTROL.md": "Guide summarizing the project's change-control system for developers.",
  "frontend/README_VERSIONING.md": "Documentation describing how semantic versioning is applied within the project.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Main React app configuring routes, query client, and service worker registration.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card for viewing activation status and redeeming vehicle registration activation tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with navigation back to dashboard.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Inline error card showing profile load failures with retry and technical details.",
  "frontend/src/components/auth/SignInScreen.tsx": "Displays the sign‑in screen using Internet Identity with branding, feature highlights, and a login button.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Renders a detailed startup error screen with backend diagnostics, retry logic, and clipboard copy support.",
  "frontend/src/components/brand/AppLogo.tsx": "Shows the Pasar Digital Community logo with configurable size options.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder component for future language switching UI.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, footer, routing, and backend‑status banner handling.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned, disabling actions when backend connectivity is degraded.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for reporting a found vehicle with validation and backend‑availability gating.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation header with logo, route buttons, user menu, and admin visibility logic.",
  "frontend/src/components/pwa/InstallAppBanner.tsx": "Shows a dismissible PWA install banner when installable and triggers the native install prompt.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Displays a dismissible backend-connection error banner with retry, status indicators, and expandable technical details.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Catches unexpected top-level render errors and displays a fallback UI instead of crashing.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Renders a user-facing error screen with guidance and a reload button when a fatal error occurs.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Manages vehicle transfer initiation with PIN entry, backend degradation checks, and transfer code display.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "A PIN entry dialog that blocks submission when backend is degraded and supports confirm/submit handlers.",
  "frontend/src/components/vehicle/VehiclePhotoSection.tsx": "Displays a vehicle photo with fallback UI if the image fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap status with classified error handling and auto-retry logic including continuous retries for service-unavailable errors.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admin checks, onboarding eligibility, invite code management, activation token handling, and system stats retrieval.",
  "frontend/src/hooks/useBackendConnectionStatus.ts": "Combines actor bootstrap and backend health into a single status object for UI availability and retry control.",
  "frontend/src/hooks/useBackendHealth.ts": "Runs periodic anonymous health checks against the backend and exposes reachability and diagnostics info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages II authentication state, login, logout, identity loading, and exposes an identity context provider.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations for marking vehicles lost/stolen/pawned or reporting them found with query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Fetches the caller’s notifications with polling and offers a mutation to mark notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Handles onboarding completion with detailed logging, error normalization, and post‑success cache invalidation.",
  "frontend/src/hooks/usePin.ts": "Manages PIN existence checks and provides mutations for setting and updating a user PIN.",
  "frontend/src/hooks/useProfile.ts": "Fetches and updates the current user's profile using identity‑scoped queries and invalidates profile cache on save.",
  "frontend/src/hooks/useTransfer.ts": "Provides transfer initiation and acceptance mutations and invalidates related vehicle caches.",
  "frontend/src/hooks/useTransfers.ts": "Duplicate transfer hooks that initiate or accept transfers and refresh related vehicle queries.",
  "frontend/src/hooks/useVehicleCheck.ts": "Runs a backend vehicle check by engine number via a simple mutation hook.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Checks vehicle registration activation status and redeems activation tokens with error handling and cache invalidation.",
  "frontend/src/hooks/useVehicles.ts": "Provides React Query hooks to fetch, register, and revoke vehicle ownership using the backend actor.",
  "frontend/src/i18n/i18n.ts": "Empty file.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file.",
  "frontend/src/i18n/languages/ar.ts": "Empty file.",
  "frontend/src/i18n/languages/en.ts": "Empty file.",
  "frontend/src/i18n/languages/id.ts": "Empty file.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file.",
  "frontend/src/i18n/storage.ts": "Empty file.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Test file placeholder with no content.",
  "frontend/src/pages/AboutPage.tsx": "Renders an informational page describing the app, its security features, and contact details.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page for accepting vehicle transfers with backend availability checks and mutation handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying system stats with admin-gating, error handling, and retry support.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page for generating activation tokens tied to a user principal with copy actions and admin-access checks.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing vehicle counts, notifications, reported vehicles, and quick action shortcuts.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays and filters a list of lost, stolen, or pawned vehicles with status details and search.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications, allows marking items as read, and shows empty or loading states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles user onboarding with profile form submission, first-admin detection, and redirects after completion.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits user profile with PIN management and backend availability checks.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides vehicle registration form with activation gating and image upload handling.",
  "frontend/src/pages/ReportFoundVehiclePage.tsx": "Lets users search by engine number and report found vehicles based on status.",
  "frontend/src/pages/RevokeOwnershipPage.tsx": "Lists user vehicles and enables ownership revocation with PIN confirmation and error handling.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Page for creating or updating a security PIN, with backend availability checks and form validation.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Provides vehicle status lookup by engine number and displays status badges, errors, and report options.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed vehicle info, status, and owner actions including revoke ownership with PIN confirmation.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists user-owned vehicles with status badges, loading/error states, and an option to register new vehicles.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker in production, handling updates and controlled reloads.",
  "frontend/src/pwa/usePwaInstallPrompt.ts": "React hook that manages the PWA install prompt lifecycle, dismissal logic, and installability state.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder for RootRouteGate.",
  "frontend/src/routes/RootRouteGate.tsx": "Controls root-level auth and bootstrap flow, routing users to sign-in, onboarding, or app layout based on state.",
  "frontend/src/test/setup.ts": "Empty test setup file placeholder.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test file placeholder for bootstrap error utilities.",
  "frontend/src/utils/actorProxy.ts": "Wraps backend actors to safely handle access control initialization and suppress invalid admin token failures.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a consistent React Query key for actor queries using the principal.",
  "frontend/src/utils/adminAllowlist.ts": "Provides a static allowlist of admin principals with helpers to check and list them.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, extracts technical details, and avoids false service-unavailable cases using health hints.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes actor call errors into user-friendly messages with optional context-specific handling and preserved technical details.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, and clearing them—including hash-based routing support.",
  "frontend/src/version.ts": "Defines the app version and build timestamp constants.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme colors, typography, container queries, animations, and custom design tokens.",
  "frontend/vitest.config.ts": "Empty test configuration file.",
  "project_state.json": "Describes project state, known issues, and requested fixes for frontend errors, vehicle workflows, and bootstrap screens."
}