{
  "backend/main.mo": "Main backend actor integrating authorization, storage, invite links, user profiles, PINs, notifications, and vehicle management with multiple public endpoints.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test IDs for tracking and verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of key frontend files across hooks, pages, components, and PWA setup.",
  "frontend/index.css": "Tailwind-based global stylesheet defining CSS variables for light and dark themes and applying base styles.",
  "frontend/index.html": "HTML entry point loading the React app and linking PWA manifest and icons.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and display configuration.",
  "frontend/public/sw.js": "Service worker implementing basic caching, fetch handling, and activation logic for offline support.",
  "frontend/src/App.tsx": "Main React router setup with authenticated routing, layout, and page registrations for all app sections.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen for unauthorized access with optional admin-claim flow and navigation controls.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders the sign-in screen using Internet Identity with branding and a login button.",
  "frontend/src/components/brand/AppLogo.tsx": "Displays the application logo at selectable sizes.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with header and footer logic based on authentication and onboarding state.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Provides a dialog for submitting a lost-vehicle report with validation and API mutation.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Provides a dialog for reporting a found vehicle, submitting a note via API.",
  "frontend/src/components/nav/AppHeader.tsx": "Renders the main navigation header with logo, menus, notifications, and user actions.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Handles initiating a vehicle transfer, showing a PIN prompt and displaying the generated transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "A dialog prompting for PIN input with error handling before secure actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user’s identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admin checks, claiming first admin, and fetching admin-only data like stats, invite codes, and registered vehicles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLostVehicles.ts": "Contains hooks for fetching lost vehicles and marking vehicles as lost or found with cache invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Provides hooks to fetch user notifications with polling and to mark notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Defines a mutation hook for completing onboarding and refreshing the user profile query.",
  "frontend/src/hooks/usePin.ts": "Offers mutations for setting up or updating a user PIN through actor calls.",
  "frontend/src/hooks/useProfile.ts": "Provides hooks to fetch caller profile status via role inspection and a placeholder save mutation that throws.",
  "frontend/src/hooks/useTransfers.ts": "Includes mutations for initiating and accepting vehicle transfers with relevant cache updates.",
  "frontend/src/hooks/useVehicles.ts": "Contains hooks to fetch user vehicles, fetch a single vehicle, and register new vehicles with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/src/main.tsx": "App entrypoint initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page describing the app, its features, and contact info with UI components.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Page for entering a transfer code and submitting it to accept vehicle ownership, with validation and success/error handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system statistics and navigation to invite token and vehicle management.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Allows admins to view, generate, and copy invite tokens, displaying used and unused tokens.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing counts of user vehicles, lost vehicles, and notifications, plus quick actions and navigation.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays and filters a list of reported lost vehicles with search, status badges, and detail cards.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with timestamps and allows marking individual notifications as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Onboarding form where users submit an invite token and profile details to complete registration.",
  "frontend/src/pages/ProfilePage.tsx": "Profile screen showing the user’s Internet Identity principal and providing logout functionality.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a vehicle with details and photo upload, submitting data via a mutation hook.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Manages creating and updating a user PIN with form validation and mutation hooks.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information about a specific vehicle, including status, photo, and owner actions.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists the user’s registered vehicles with status badges and navigation to registration or detail pages.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters (including hash), persisting them in sessionStorage, and clearing stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, dark mode, extended colors, fonts, shadows, and custom animations.",
  "project_state.json": "Project state file outlining app summary, architecture notes, known issues, and a list of implemented features with versions."
}