{
  "backend/main.mo": "Motoko actor managing user profiles, vehicles, notifications, invite codes, permissions, and activation tokens with various helper checks and admin/user operations.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Lookup list providing brief summaries of numerous frontend files and their responsibilities.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and hooks rules with custom warnings and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier configuration defining formatting rules such as print width, semicolons, and quote style.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Policy outlining protected interfaces, backend API stability rules, and mandatory review and verification steps.",
  "frontend/CHANGELOG.md": "Changelog documenting release history, fixes, changes, and technical notes for versions 1.0.0 and 1.0.1.",
  "frontend/ci-run-gates.sh": "Runs frontend quality checks by invoking the npm gates script.",
  "frontend/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables for app styling.",
  "frontend/index.html": "Base HTML file setting PWA metadata, icons, and bootstrapping the React app.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist requiring validation of behavior, routes, backend API, state impact, quality gates, and documentation.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, and startup behavior.",
  "frontend/public/sw.js": "Service worker handling caching strategy, asset fetching rules, and cache versioning.",
  "frontend/QUALITY_GATES.md": "Documentation describing quality gate requirements and how to run automated checks.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining usage of the project's change-control system for stable feature development.",
  "frontend/README_VERSIONING.md": "Documentation describing semantic versioning rules used in the project.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file intended for router smoke tests.",
  "frontend/src/App.tsx": "Sets up React Query, routing, and service worker registration for the app.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card enabling users to view activation status and redeem activation tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with navigation back to the dashboard.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Shows an inline profile load error with retry options and technical details.",
  "frontend/src/components/auth/SignInScreen.tsx": "Internet Identity sign‑in screen with branding, feature highlights, and login button state handling.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Displays backend startup error diagnostics with retry modes, health checks, and clipboard copy support.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the Pasar Digital Community logo with configurable size classes.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder file for a language switcher component.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, footer, routing, install banner, and degraded backend connection banner support.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned, disabling actions when backend is degraded.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for reporting a found vehicle with validation and backend degradation gating.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with user menu, admin detection, mobile menu, and navigation links.",
  "frontend/src/components/pwa/InstallAppBanner.tsx": "Shows a dismissible PWA install banner when install is available and triggers the browser install prompt.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Displays a dismissible banner showing backend connection errors with retry, status, and expandable technical details.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches unexpected top-level errors and renders a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fullscreen fallback card explaining a critical app error with steps and a reload button.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Form to initiate a vehicle transfer, blocked when backend is degraded, and shows generated transfer code on success.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Dialog prompting for PIN input, disabling submission when backend is degraded and supporting pending states.",
  "frontend/src/components/vehicle/VehiclePhotoSection.tsx": "Renders a vehicle photo with error fallback if the image fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap status with retry logic, including continuous retries for service-unavailable states and backend health integration.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations such as checking admin status, onboarding eligibility, invite codes, activation tokens, and system stats.",
  "frontend/src/hooks/useBackendConnectionStatus.ts": "Combines actor bootstrap and health checks to derive backend availability and status messages.",
  "frontend/src/hooks/useBackendHealth.ts": "Performs periodic anonymous backend health checks and exposes reachability and diagnostic info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, login flow, and context access.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations for marking vehicles lost/stolen/pawned or reporting them found.",
  "frontend/src/hooks/useNotifications.ts": "Retrieves user notifications and marks notifications as read with cache invalidation.",
  "frontend/src/hooks/useOnboarding.ts": "Handles onboarding completion with logging, error normalization, and related cache updates.",
  "frontend/src/hooks/usePin.ts": "Queries and updates the user PIN, including setup and change operations with cache invalidation.",
  "frontend/src/hooks/useProfile.ts": "Fetches and updates the caller's user profile, tied to identity and actor availability.",
  "frontend/src/hooks/useTransfer.ts": "Initiates and accepts vehicle transfers and refreshes relevant vehicle queries.",
  "frontend/src/hooks/useTransfers.ts": "Duplicate transfer hooks for initiating and accepting vehicle transfers with cache updates.",
  "frontend/src/hooks/useVehicleCheck.ts": "Mutation for backend vehicle status checks using engine number.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Checks vehicle‑registration activation status and redeems activation tokens with error handling.",
  "frontend/src/hooks/useVehicles.ts": "React Query hooks for fetching user vehicles, individual vehicles, registering a vehicle, and revoking ownership with cache updates.",
  "frontend/src/i18n/i18n.ts": "Empty i18n configuration placeholder.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file placeholder for i18n provider.",
  "frontend/src/i18n/languages/ar.ts": "Empty Arabic translation file placeholder.",
  "frontend/src/i18n/languages/en.ts": "Empty English translation file placeholder.",
  "frontend/src/i18n/languages/id.ts": "Empty Indonesian translation file placeholder.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty Simplified Chinese translation file placeholder.",
  "frontend/src/i18n/storage.ts": "Empty i18n storage utility placeholder.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder for VehiclesPage fetch-flow tests.",
  "frontend/src/pages/AboutPage.tsx": "About page describing the app, features, and admin contact info with UI cards and branding.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Page for accepting vehicle transfers with backend degradation checks, form submission, and navigation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin-only dashboard showing system stats, access validation, and error handling for admin and stats queries.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page for generating activation tokens, validating principals, and copying tokens or instructions, with admin-access checks and UI states.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing vehicle stats, notifications, reported vehicles count, and quick action shortcuts.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Page listing lost, stolen, or pawned vehicles with search, status badges, and reporting dialog.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays a list of user notifications and allows marking them as read, with loading and empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty page placeholder for onboarding via invite.",
  "frontend/src/pages/OnboardingPage.tsx": "User onboarding form that collects profile data and optionally sets up the first admin account.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page with backend gating, editable user info, and PIN setup/update dialog.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form for registering a vehicle with photo upload, activation checks, and backend availability gating.",
  "frontend/src/pages/ReportFoundVehiclePage.tsx": "Searches vehicles by engine number and allows reporting found vehicles when eligible based on status.",
  "frontend/src/pages/RevokeOwnershipPage.tsx": "Lists owned vehicles and enables revoking ownership with PIN confirmation, handling loading and error states.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Page for creating or updating a security PIN with validation and backend availability checks.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Engine-number lookup page that displays vehicle status, badges, errors, and found-vehicle reporting options.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed vehicle info, ownership actions, status badges, and PIN-gated revoke functionality.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists user's vehicles with status badges, error/loading states, and vehicle registration access handling.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker in production, handling updates, skip-waiting, and controlled page reloads.",
  "frontend/src/pwa/usePwaInstallPrompt.ts": "React hook that manages PWA install prompts, dismissal timing, and installability detection based on browser events.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder for RootRouteGate.",
  "frontend/src/routes/RootRouteGate.tsx": "Root routing guard handling authentication, profile onboarding redirects, and bootstrap error or loading states before rendering the app.",
  "frontend/src/test/setup.ts": "Empty test setup file placeholder.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test file placeholder for bootstrap error utilities.",
  "frontend/src/utils/actorProxy.ts": "Creates a safe actor proxy that wraps access-control initialization, handling invalid admin tokens without breaking startup.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a canonical React Query key for actor-related queries based on identity.",
  "frontend/src/utils/adminAllowlist.ts": "Defines allowlisted admin principals and provides helpers to check and retrieve them.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, extracts technical details, detects canister-stopped conditions, and provides user-facing guidance messages.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes actor call errors into user-facing messages with context-specific handling and optional technical details.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty utility file placeholder for onboarding troubleshooting logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/version.ts": "Defines the app’s version and build timestamp.",
  "frontend/tailwind.config.js": "Configures TailwindCSS themes, colors, plugins, and animations for the frontend.",
  "frontend/vitest.config.ts": "Empty Vitest configuration placeholder.",
  "project_state.json": "Describes project state, known issues, features, and tasks related to vehicle registration and ownership workflows."
}