{
  "backend/main.mo": "Motoko backend implementing authorization, invite onboarding, user profiles, notifications, and vehicle management with storage and admin‑gated functions.",
  "feature_evidence.json": "Feature report mapping implemented features to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for several frontend files related to profiles and routing.",
  "frontend/index.css": "Tailwind CSS configuration with light/dark theme variables and base styling.",
  "frontend/index.html": "Minimal HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React router setup with auth gating and routes for onboarding, vehicles, admin tools, and user features.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access‑denied message with a button returning to the dashboard.",
  "frontend/src/components/auth/SignInScreen.tsx": "Internet Identity login screen with branding and informational content.",
  "frontend/src/components/brand/AppLogo.tsx": "Logo component rendering the application image in configurable sizes.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper handling header visibility based on authentication and onboarding state.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog UI for submitting a lost-vehicle report with validation and mutation trigger.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog allowing users to submit a found-vehicle report tied to a specific vehicle.",
  "frontend/src/components/nav/AppHeader.tsx": "Application header with navigation, notifications, user menu, and admin access handling.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to initiate vehicle ownership transfer, showing PIN dialog and generated transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Reusable dialog prompting for a PIN with error handling and submission flow.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and handles query invalidation.",
  "frontend/src/hooks/useAdmin.ts": "Hooks for admin-related queries and mutations, including admin checks, stats, invite codes, and registered vehicles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useLostVehicles.ts": "Provides React Query hooks to fetch lost vehicles and mutate lost/found status, with cache invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Implements hooks to fetch user notifications with polling and mark them as read.",
  "frontend/src/hooks/useOnboarding.ts": "Contains a mutation hook to complete user onboarding and refresh the profile cache.",
  "frontend/src/hooks/usePin.ts": "Offers mutations for setting up and updating a user's PIN through the actor API.",
  "frontend/src/hooks/useProfile.ts": "Includes hooks to fetch a placeholder user profile and a no-op profile-saving mutation with cache invalidation.",
  "frontend/src/hooks/useTransfers.ts": "Defines mutations for initiating and accepting vehicle transfers, updating related cached data.",
  "frontend/src/hooks/useVehicles.ts": "Provides hooks to fetch user vehicles, fetch a single vehicle, and register new vehicles with cache refresh.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theming variables, and dark mode overrides.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Page allowing users to enter or prefill a transfer code to accept a vehicle transfer with error handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system statistics and navigation to token management and vehicle lists.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page for generating, listing, and managing invitation tokens with copy‑link functionality.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying vehicle, lost vehicle, and notification stats with quick navigation actions.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Page listing lost vehicles with search filtering and vehicle detail display including photos.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications, allows marking them as read, and shows loading/empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles account onboarding using an invite token and user profile form, then completes onboarding and redirects.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile info, including principal ID, with a notice that updates require admin assistance.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a vehicle, including photo upload with progress tracking, then submits data to the backend.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Manages creation and updating of a PIN used for secure vehicle transfers, with validation and status handling.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays full details of a specific vehicle, including status, photo, and ownership actions like transfers or lost reports.",
  "frontend/src/pages/VehiclesPage.tsx": "Displays the user's registered vehicles with status badges and navigation to registration or vehicle detail pages.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and utility plugins.",
  "project_state.json": "Project metadata describing features, architecture, known issues, and current implementation state."
}