{
  "backend/main.mo": "Main backend actor defining user profiles, vehicles, activation tokens, invite codes, and admin authorization logic with various Maps for persistent state.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including hooks, pages, components, and configuration.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and React Hooks rules with custom warnings and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier configuration specifying formatting rules like semicolons, print width, tabs, and trailing commas.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Defines change‑control rules, protected interfaces, and mandatory review steps for modifying routes, authentication, or backend APIs.",
  "frontend/CHANGELOG.md": "Changelog documenting versioned releases, added quality gates, protected interfaces, and initial system features.",
  "frontend/ci-run-gates.sh": "Shell script executing all frontend quality gates via npm.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global styling.",
  "frontend/index.html": "Main HTML entry configuring PWA metadata and loading the React app root.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist enforcing change‑control compliance, quality gates, manual testing, and documentation updates.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme, and categories.",
  "frontend/public/sw.js": "Service worker implementing cache strategies with network-first for HTML and cache-first for static assets.",
  "frontend/QUALITY_GATES.md": "Documentation describing frontend quality gates and how to run them.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how developers should follow the project's change‑control system.",
  "frontend/README_VERSIONING.md": "Documentation of semantic versioning rules and release discipline for the project.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up React Router routes, query client, Internet Identity provider, and wraps the app in an error boundary.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card enabling users to view activation status and redeem vehicle registration activation tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied page with navigation back to the dashboard and admin info alert.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Error screen shown when profile loading fails, with diagnostics, backend health info, and copyable error details.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign‑in screen using Internet Identity with branding and feature highlights.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Error screen component that classifies bootstrap failures, shows backend health, and handles manual or auto retry with copy-to-clipboard diagnostics.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo at selectable sizes using a static image asset.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty file with no implementation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main authenticated app layout with header, footer, and navigation visibility logic.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned with validation and backend mutation.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for submitting a found vehicle report with text input and mutation handling.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with logo, user menu, dynamic admin entry, and mobile menu support.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "React error boundary that catches render failures and displays a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback screen shown on critical app errors with reload instructions.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to initiate a vehicle transfer using PIN verification and generate a shareable transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "A PIN entry dialog component with validation, error display, and submit handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap errors and implements bounded and continuous auto‑retry logic.",
  "frontend/src/hooks/useAdmin.ts": "Admin-related hooks for checking admin status, onboarding permissions, invite codes, activation tokens, and system stats.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend reachability using an anonymous actor and polls for diagnostic info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks for fetching lost vehicles and marking vehicles lost, stolen, pawned, or found.",
  "frontend/src/hooks/useNotifications.ts": "Hooks for fetching user notifications and marking notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Handles onboarding mutation with detailed logging, error normalization, and query invalidation.",
  "frontend/src/hooks/usePin.ts": "Hooks for setting up and updating a user's PIN via backend actor calls.",
  "frontend/src/hooks/useProfile.ts": "Hooks to fetch and update the current user's profile using react-query and the backend actor.",
  "frontend/src/hooks/useTransfers.ts": "Provides mutations for initiating and accepting vehicle ownership transfers and invalidates related queries.",
  "frontend/src/hooks/useVehicleCheck.ts": "Mutation hook that checks vehicle status by engine number via the backend actor.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Queries activation status and provides a mutation to redeem activation tokens with error handling and cache invalidation.",
  "frontend/src/hooks/useVehicles.ts": "Hooks for fetching user vehicles, fetching a single vehicle, and registering a new vehicle with cache updates.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder for i18n setup logic.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file placeholder for the i18n provider implementation.",
  "frontend/src/i18n/languages/ar.ts": "Empty file intended for Arabic translation strings.",
  "frontend/src/i18n/languages/en.ts": "Empty file intended for English translation strings.",
  "frontend/src/i18n/languages/id.ts": "Empty file intended for Indonesian translation strings.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file intended for Simplified Chinese translation strings.",
  "frontend/src/i18n/storage.ts": "Empty file placeholder for i18n storage utilities.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Root entry that sets up React Query, Internet Identity, global styles, and renders the App component.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder for VehiclesPage fetch flow.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page describing the application, features, and admin contact info.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page allowing a user to accept a vehicle transfer using a transfer code with validation and feedback.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system stats, admin verification flow, and error handling for loading admin status and system metrics.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page for generating activation tokens for user principals with validation, copy helpers, and admin-access checks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user vehicle stats, notifications, and quick action links on the main dashboard.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays reported lost, stolen, or pawned vehicles with search, status badges, and a report-found dialog.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows user notifications and allows marking them as read with timestamp and read-state UI.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles user onboarding form, first-admin detection, and profile submission before redirecting.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile data, supports logout, and shows vehicle registration activation status.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form for registering a new vehicle including photo upload with progress and activation checks.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Allows users to create or update a PIN used for secure vehicle ownership transfers.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Provides a form to check a vehicle by engine number and displays result details with status badges and error/loading states.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed information for a specific vehicle, including status, ownership actions, and lost/stolen report details.",
  "frontend/src/pages/VehiclesPage.tsx": "Displays the current user's vehicles in a grid with status badges and offers navigation to register new vehicles or view details.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder for RootRouteGate tests.",
  "frontend/src/routes/RootRouteGate.tsx": "Handles authentication, profile loading, actor bootstrap retries, and routing to onboarding or main layout.",
  "frontend/src/test/setup.ts": "Empty test setup file.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test file placeholder for bootstrap error utilities.",
  "frontend/src/utils/actorProxy.ts": "Creates a proxy that safely wraps actor initialization, handling invalid admin tokens without blocking startup.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a stable React Query key for actor-related queries.",
  "frontend/src/utils/adminAllowlist.ts": "Provides an allowlisted set of admin principals and helpers to query them.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, detects stopped canisters, extracts technical details, and provides user guidance.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes actor call errors into user-facing messages with categorized error types.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty onboarding troubleshooting utility file.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/version.ts": "Defines the app version and build timestamp.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, colors, animations, and plugin setup.",
  "frontend/vitest.config.ts": "Empty Vitest configuration file.",
  "project_state.json": "Describes the onboarding/registration flow, current registration failure, and related frontend/backend issues. Lists architectural notes, known issues, image requirements, and pending feature requests for fixing onboarding and PWA icons."
}