{
  "backend/main.mo": "Main Motoko canister managing user profiles, vehicles, notifications, activation tokens, and access control with admin/user permission helpers.",
  "feature_evidence.json": "Feature evidence report mapping PWA-related features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries describing the purpose of various frontend source files.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and hooks rules with custom warnings and ignore patterns.",
  "frontend/.prettierrc.json": "Prettier formatting configuration defining code style rules like quotes, width, and trailing commas.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Policy defining stable interfaces, backend contracts, and mandatory review and verification steps for changes.",
  "frontend/CHANGELOG.md": "Project changelog documenting PWA additions, route features, and release history.",
  "frontend/ci-run-gates.sh": "Shell script that runs frontend quality gates via npm.",
  "frontend/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables for UI styling.",
  "frontend/index.html": "HTML entry point that sets up metadata, PWA icons, and loads the main React script.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist ensuring compliance with change-control rules, testing, and documentation updates.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and behavior for installation.",
  "frontend/public/sw.js": "Service worker implementing caching rules with network-first for HTML and cache-first for static assets.",
  "frontend/QUALITY_GATES.md": "Documentation describing the quality gates system and how to run automated checks.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how developers should follow the change-control system during feature work.",
  "frontend/README_VERSIONING.md": "Documentation describing semantic versioning rules for the project.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Placeholder test file with no content.",
  "frontend/src/App.tsx": "Sets up the React app, routes, query client, and initializes service worker registration.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card to show activation status and redeem vehicle registration activation tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with navigation back to the dashboard.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Error screen for failed profile loading with backend diagnostics and copyable error details.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders the Internet Identity sign‑in screen with branding, feature highlights, and a login button tied to the Internet Identity hook.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Displays detailed startup bootstrap errors with retry logic, backend health checks, and clipboard copy for diagnostics.",
  "frontend/src/components/brand/AppLogo.tsx": "Shows the app logo image in configurable sizes for branding use across the UI.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder file for a future language switcher component.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with optional header, routed content area, and footer including version info.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Modal dialog allowing users to report a vehicle as lost, stolen, or pawned with notes and validation.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Modal dialog for submitting a found‑vehicle report with required description text.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation header with logo, navigation buttons, user menu, admin visibility logic, and mobile menu support.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches top‑level render errors and displays a fallback UI instead of crashing.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback screen for unrecoverable app errors with reload guidance and troubleshooting tips.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "UI panel that initiates a vehicle transfer by verifying a PIN and generating a transfer code with copyable link.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Dialog prompting the user for a PIN with validation and error handling before submitting.",
  "frontend/src/components/vehicle/VehiclePhotoSection.tsx": "Displays a vehicle photo and shows a fallback message if the image fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap errors and manages bounded and continuous retry logic with timers.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations such as checking admin status and generating invite or activation codes.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend reachability and diagnostics using an anonymous actor with periodic polling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations to mark vehicles lost or found with query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Retrieves user notifications and allows marking a notification as read with auto-refresh.",
  "frontend/src/hooks/useOnboarding.ts": "Provides a mutation hook to complete onboarding via actor calls with detailed logging and query invalidation.",
  "frontend/src/hooks/usePin.ts": "Contains hooks for checking, setting, and updating a user PIN through actor methods and invalidates PIN-related queries.",
  "frontend/src/hooks/useProfile.ts": "Defines hooks to fetch and save the caller's user profile using actor methods with query control and invalidation.",
  "frontend/src/hooks/useTransfers.ts": "Implements hooks to initiate and accept vehicle transfers, updating related vehicle queries on success.",
  "frontend/src/hooks/useVehicleCheck.ts": "Provides a mutation hook that checks vehicle status by engine number via the actor.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Supplies hooks to check activation for vehicle registration and redeem activation tokens, handling errors and cache updates.",
  "frontend/src/hooks/useVehicles.ts": "Offers hooks to fetch, register, revoke, and retrieve specific vehicles through actor calls with query invalidation.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder for i18n configuration logic.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file placeholder for the i18n provider implementation.",
  "frontend/src/i18n/languages/ar.ts": "Empty language file intended for Arabic translations.",
  "frontend/src/i18n/languages/en.ts": "Empty language file intended for English translations.",
  "frontend/src/i18n/languages/id.ts": "Empty language file intended for Indonesian translations.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty language file intended for Simplified Chinese translations.",
  "frontend/src/i18n/storage.ts": "Empty file placeholder for i18n storage or persistence utilities.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder for VehiclesPage fetch flow tests.",
  "frontend/src/pages/AboutPage.tsx": "Renders an informational About page describing the application, features, and contact details.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Implements the UI and logic for accepting a vehicle transfer using a transfer code.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system stats, access checks, and error handling for admin verification and stats loading.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin interface for generating activation tokens for users with validation, copy helpers, and access checks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics for vehicles, notifications, and reported statuses with quick navigation actions.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Lists lost, stolen, or pawned vehicles with search filtering and status details.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows user notifications and allows marking them as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty onboarding invite page placeholder.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles onboarding form submission and first-admin setup logic.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to edit their profile, manage PINs, and view activation status.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a vehicle with photo upload and activation checks.",
  "frontend/src/pages/ReportFoundVehiclePage.tsx": "Provides a form to search a vehicle by engine number and, if marked Lost/Stolen/Pawned, allows submitting a found report.",
  "frontend/src/pages/RevokeOwnershipPage.tsx": "Displays the user's active vehicles and handles revoking ownership with PIN confirmation and navigation feedback.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Handles PIN creation and updates for securing ownership transfer actions with validation and toast notifications.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Lets users check a vehicle’s status by engine number, showing badges, alerts, photos, and found‑report options based on status.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed vehicle info, status badges, transfer options, and lets the owner revoke ownership with PIN verification.",
  "frontend/src/pages/VehiclesPage.tsx": "Displays the user's vehicles, activation status, and registration options, with conditional UI based on fetch states and vehicle status badges.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker in production, handles update detection, and logs registration results or errors.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder for RootRouteGate tests.",
  "frontend/src/routes/RootRouteGate.tsx": "Controls app bootstrapping, authentication flow, profile loading, and actor initialization with multiple error and retry states.",
  "frontend/src/test/setup.ts": "Empty test setup file placeholder.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test file placeholder for bootstrap error utilities.",
  "frontend/src/utils/actorProxy.ts": "Wraps backend actor to safely handle admin initialization, suppress invalid token failures, and avoid startup traps.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a consistent React Query key for actor-related queries based on principal identity.",
  "frontend/src/utils/adminAllowlist.ts": "Provides allowlist checks and retrieval for admin principals to support role-based access control bypass.",
  "frontend/src/utils/bootstrapError.ts": "Provides helpers to detect canister-stopped errors, extract error text, and classify bootstrap errors with appropriate guidance messages.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes actor call errors into user-friendly messages with categorized error types while preserving raw error data.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/version.ts": "Defines the app’s version and build timestamp.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, typography, animations, and design tokens for the frontend.",
  "frontend/vitest.config.ts": "Empty Vitest configuration file.",
  "project_state.json": "Captures project metadata, PWA requirements, current issues, and existing feature definitions."
}