{
  "backend/main.mo": "Main Motoko canister implementing user profiles, vehicles, notifications, invite codes, and admin authorization using multiple mixins and internal maps.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs with high-level metadata.",
  "frontend-file-summaries.txt": "List of frontend file paths with short descriptions summarizing their functionality and roles in the application.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and hook rules with project-specific warnings and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier formatting configuration specifying style rules like print width, quotes, and trailing commas.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Defines protected interfaces and mandatory rules for modifying routes, authentication, backend APIs, and data structures.",
  "frontend/CHANGELOG.md": "Project changelog documenting versioned changes, new features, and protected interfaces.",
  "frontend/ci-run-gates.sh": "Shell script running all frontend quality gate checks via npm for CI automation.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry point loading the PWA manifest, icons, and main React script.",
  "frontend/PR_CHECKLIST.md": "Pull‑request checklist enforcing change‑control, quality gates, testing steps, and documentation updates.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring metadata, icons, theme colors, and categories.",
  "frontend/public/sw.js": "Service worker implementing cache strategies for static assets and navigation requests.",
  "frontend/QUALITY_GATES.md": "Documentation for automated quality‑gate checks including linting, formatting, typechecking, and tests.",
  "frontend/README_CHANGE_CONTROL.md": "Developer guide explaining how to follow the project's change‑control system during development.",
  "frontend/README_VERSIONING.md": "Documentation describing the project's semantic versioning process and release update rules.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up the app’s router, routes, and theme provider for the main React application.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI for access-denied state with optional admin-claim flow and profile input form.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Displays detailed profile-load error diagnostics with backend health checks and copy-to-clipboard support.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign‑in UI using Internet Identity with branding and feature highlights.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Error screen handling bootstrap failures with retry logic, backend health checks, and copy-to-clipboard details.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the app logo with adjustable sizing.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty file with no implementation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper showing header/footer based on authentication and routing.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog allowing users to report a vehicle as lost, stolen, or pawned with notes.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for submitting a report when a previously lost vehicle is found.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with user menu, links, and dynamic admin access.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches top-level render errors and shows a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "UI fallback displayed when a critical error occurs, offering a reload option.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Component to initiate a vehicle transfer using PIN verification and produce a shareable transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "PIN entry dialog with validation, error display, and submit handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap errors and manages bounded and continuous retry logic with timers.",
  "frontend/src/hooks/useAdmin.ts": "Admin-related hooks for checking admin status, onboarding the first admin, and fetching admin-only data.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend health anonymously and reports reachability and diagnostic info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks for fetching lost vehicles and marking vehicles as lost, stolen, pawned, or found.",
  "frontend/src/hooks/useNotifications.ts": "Hooks to fetch user notifications and mark them as read with periodic polling.",
  "frontend/src/hooks/useOnboarding.ts": "Mutation hook to complete user onboarding using an invite token.",
  "frontend/src/hooks/usePin.ts": "Hooks for setting up and updating the user's PIN.",
  "frontend/src/hooks/useProfile.ts": "Hooks for fetching and saving the current user's profile with identity-aware caching.",
  "frontend/src/hooks/useTransfers.ts": "Provides mutations for initiating and accepting vehicle transfers, invalidating relevant queries on success.",
  "frontend/src/hooks/useVehicleCheck.ts": "Defines a mutation that checks a vehicle's status using the backend actor.",
  "frontend/src/hooks/useVehicles.ts": "Implements queries and mutations for fetching user vehicles, fetching a single vehicle, and registering a new one with cache invalidation.",
  "frontend/src/i18n/i18n.ts": "Empty file.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file.",
  "frontend/src/i18n/languages/ar.ts": "Empty file.",
  "frontend/src/i18n/languages/en.ts": "Empty file.",
  "frontend/src/i18n/languages/id.ts": "Empty file.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file.",
  "frontend/src/i18n/storage.ts": "Empty file.",
  "frontend/src/index.css": "Sets Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder.",
  "frontend/src/pages/AboutPage.tsx": "Renders an informational page describing the app, features, and admin contact details.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page for accepting vehicle transfers using a transfer code, handling submission and errors.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system stats, admin verification handling, and error states.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Allows admins to view, generate, and manage invite tokens with copy and status features.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user stats, quick actions, and links based on vehicles, reports, notifications, and admin status.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays and filters a list of reported lost, stolen, or pawned vehicles with status badges and details.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays a list of user notifications, allows marking items as read, and shows loading or empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles invite-based onboarding with admin checks, form submission, and validation for creating a user profile.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user's profile with form handling, save actions, and logout support.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a new vehicle, upload a photo with progress tracking, and submit vehicle data.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Manages PIN setup and updates with validation and separate flows for initial creation and modification.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Checks a vehicle's status by engine number and displays results with status badges, error handling, and vehicle details.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information for a vehicle, including status badges, owner actions, and lost/stolen report details.",
  "frontend/src/pages/VehiclesPage.tsx": "Shows the user's vehicle list with status badges and provides navigation to register or view vehicles.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder.",
  "frontend/src/routes/RootRouteGate.tsx": "Controls authentication, profile loading, admin bypass logic, and actor bootstrap flows before showing the app.",
  "frontend/src/test/setup.ts": "Empty test setup file placeholder.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test file placeholder.",
  "frontend/src/utils/actorProxy.ts": "Provides a proxy wrapper around backend actors to safely handle admin initialization and prevent startup failures.",
  "frontend/src/utils/actorQueryKey.ts": "Creates consistent React Query keys for actor-related queries.",
  "frontend/src/utils/adminAllowlist.ts": "Defines and checks allowlisted admin principals for onboarding bypass.",
  "frontend/src/utils/bootstrapError.ts": "Provides utilities to detect canister-stopped errors, extract technical error messages, and classify bootstrap errors with appropriate guidance.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters, including persistence in sessionStorage and hash-based routing support.",
  "frontend/src/version.ts": "Defines the app’s version and build date constants.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, breakpoints, animations, and plugin integrations.",
  "frontend/vitest.config.ts": "Empty Vitest configuration file placeholder.",
  "project_state.json": "Describes project state, requirements, and issues focused on improving invite-token onboarding UX and session persistence."
}