{
  "backend/main.mo": "Motoko canister defining user profiles, vehicles, notifications, invite tokens, activation tokens, and permission checks with admin and user authorization helpers.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend source file paths to short functional descriptions for documentation or tooling.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and React Hooks rules with custom warnings and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier formatting configuration defining code style rules such as semicolons, print width, and quote style.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Change-control policy outlining protected interfaces, required review steps, and mandatory checklists for code modifications.",
  "frontend/CHANGELOG.md": "Project changelog detailing added features, changes, and protected interfaces for versions 1.0.0 and 0.1.0.",
  "frontend/ci-run-gates.sh": "Shell script running all frontend quality gates in CI using npm run gates.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, theming, and base UI styles for light and dark modes.",
  "frontend/index.html": "HTML entrypoint configuring metadata, PWA manifest, icons, and loading the main React application.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist enforcing change-control, quality gates, testing, and documentation requirements.",
  "frontend/public/manifest.webmanifest": "Defines PWA metadata, theme colors, icons, and app categories for Pasar Digital Community.",
  "frontend/public/sw.js": "Implements service worker with cache strategies for static assets, exclusions for PWA icons, and cache version management.",
  "frontend/QUALITY_GATES.md": "Documentation describing automated quality gates and instructions for running them.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how to use the change-control system during development.",
  "frontend/README_VERSIONING.md": "Versioning guide describing semantic versioning usage and version update rules.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up React Router routes and wraps the app with query client, identity provider, and error boundary.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card allowing users to view activation status and redeem vehicle registration activation tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with navigation back to the dashboard and admin info alert.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Error screen shown when profile loading fails, with backend health diagnostics and copyable error details.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign‑in screen prompting users to authenticate with Internet Identity and explaining system benefits.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Startup error screen with retry logic, backend health status, and detailed error copying functionality.",
  "frontend/src/components/brand/AppLogo.tsx": "Displays the app logo with configurable size and optional styling.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder file for a language switcher component.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with optional header and footer based on authentication and routing.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned with category and note input.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog allowing users to submit a found report for a previously lost vehicle.",
  "frontend/src/components/nav/AppHeader.tsx": "Responsive header with navigation, user menu, and admin visibility logic.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches unexpected app errors and shows a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback screen explaining critical errors and offering a reload action.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Initiates a vehicle transfer requiring PIN verification and generates a shareable transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "PIN entry dialog with validation used to authorize sensitive actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap status with auto and continuous retry logic for stopped-canister errors.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations, including admin checks, invite codes, activation tokens, and system stats.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend reachability and diagnostics using an anonymous actor with periodic refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations to mark vehicles lost or found with cache updates.",
  "frontend/src/hooks/useNotifications.ts": "Retrieves user notifications and allows marking them as read with periodic polling.",
  "frontend/src/hooks/useOnboarding.ts": "Handles onboarding mutation with detailed logging, error normalization, and related cache invalidations.",
  "frontend/src/hooks/usePin.ts": "Manages PIN existence checks and provides setup and update PIN mutations.",
  "frontend/src/hooks/useProfile.ts": "Fetches and saves the caller’s user profile with identity-aware query keys.",
  "frontend/src/hooks/useTransfers.ts": "Provides mutations to initiate and accept vehicle transfers and updates related caches.",
  "frontend/src/hooks/useVehicleCheck.ts": "Runs a vehicle status check by engine number via the backend actor.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Provides React Query hooks to check vehicle registration activation and redeem activation tokens, with error handling and cache invalidation.",
  "frontend/src/hooks/useVehicles.ts": "Defines hooks for fetching user vehicles, fetching a single vehicle, and registering a vehicle using the actor API with cache updates.",
  "frontend/src/i18n/i18n.ts": "Empty file.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file.",
  "frontend/src/i18n/languages/ar.ts": "Empty file.",
  "frontend/src/i18n/languages/en.ts": "Empty file.",
  "frontend/src/i18n/languages/id.ts": "Empty file.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file.",
  "frontend/src/i18n/storage.ts": "Empty file.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines light/dark theme CSS variables for colors, borders, and layout.",
  "frontend/src/main.tsx": "Bootstrap file initializing React, React Query, and Internet Identity provider, then rendering the App.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder for VehiclesPage fetch-flow tests.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with app description, features, and admin contact info.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Provides a form to accept vehicle ownership transfer via code with validation, mutation handling, and navigation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system statistics with loading, error handling, and access control checks.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page to generate and manage vehicle registration activation tokens with validation and clipboard helpers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user dashboard with vehicle stats, notifications, reported vehicles, and quick action cards.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Shows a searchable list of lost, stolen, or pawned vehicles with status badges and report details.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications, supports marking items as read, and handles loading and empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty file placeholder for onboarding via invite.",
  "frontend/src/pages/OnboardingPage.tsx": "Provides onboarding form to create a user profile and optionally claim first‑admin status, then navigates based on result.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits user profile data, manages logout, and includes PIN creation and update flows.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form to register a vehicle with photo upload and activation checks, submitting data to backend.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Allows users to create or update a PIN for secure vehicle ownership transfer.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Provides engine-number search to check vehicle status and displays detailed results with status badges.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed info for a single vehicle, including status badges, reports, and owner-only actions like transfers or marking lost.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists the user's vehicles with status indicators and provides registration or activation actions based on account state.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder for RootRouteGate tests.",
  "frontend/src/routes/RootRouteGate.tsx": "Governs app bootstrapping, authentication, profile loading, and retry flows before rendering the main layout.",
  "frontend/src/test/setup.ts": "Empty test setup file placeholder.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test file placeholder for bootstrap error utilities.",
  "frontend/src/utils/actorProxy.ts": "Creates a proxy around backend actors to safely handle admin initialization tokens and avoid startup failures.",
  "frontend/src/utils/actorQueryKey.ts": "Provides a consistent React Query key generator for actor-related queries.",
  "frontend/src/utils/adminAllowlist.ts": "Implements a client-side allowlist for admin principals with helpers to check and retrieve entries.",
  "frontend/src/utils/bootstrapError.ts": "Provides functions to classify bootstrap errors, detect stopped canister conditions, and generate user guidance with extracted technical details.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes actor-call errors into user-safe messages with categorized error types and preserved raw error data.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/version.ts": "Defines the application's version and build timestamp constants.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, typography, animations, and container settings.",
  "frontend/vitest.config.ts": "Empty Vitest configuration file.",
  "project_state.json": "Project metadata detailing state, features, and new feature requests related to restoring PIN management without impacting existing users."
}