{
  "backend/main.mo": "Motoko actor implementing user onboarding, authorization, invite codes, vehicle records, status reporting, notifications, and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting an onboarding error‑handling update and its related components, files, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized frontend files describing hooks, pages, components, routing, PWA setup, and actor integration behavior.",
  "frontend/.eslintrc.cjs": "ESLint configuration for TypeScript and React with custom rules and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier configuration specifying formatting rules such as semicolons, print width, and quote style.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Defines protected interfaces, backend API stability rules, and mandatory review checklist for safe code changes.",
  "frontend/CHANGELOG.md": "Project changelog detailing added features, quality gates, versioning system, and release notes for versions 1.0.0 and 0.1.0.",
  "frontend/ci-run-gates.sh": "Shell script running frontend quality gates in CI by invoking npm run gates.",
  "frontend/index.css": "Tailwind CSS configuration defining design tokens, light/dark theme variables, and base styling rules.",
  "frontend/index.html": "HTML entry point setting metadata, PWA manifest, icons, and loading the main React application.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist enforcing change‑control, quality gates, documentation updates, and manual testing.",
  "frontend/public/manifest.webmanifest": "Defines PWA metadata including icons, colors, categories, and default language.",
  "frontend/public/sw.js": "Service worker handling caching rules with network-first and cache-first strategies and icon exclusions.",
  "frontend/QUALITY_GATES.md": "Documentation explaining automated quality gates and how to run them.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how to use the change‑control system during feature development.",
  "frontend/README_VERSIONING.md": "Documentation on semantic versioning practices and version‑update procedure.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up the React app theme and full TanStack Router route tree for all pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI for access denial with optional first-admin claim form and navigation logic.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Displays profile loading errors with backend health info and error copy functionality.",
  "frontend/src/components/auth/SignInScreen.tsx": "Internet Identity sign-in screen with app branding and feature highlights.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Shows startup initialization errors with retry logic, health diagnostics, and error copying.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo in configurable sizes.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty file for future language switcher component.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper that shows header and footer based on authentication and routing, rendering children within the main area.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned with category selection and note submission.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for submitting a found report for a previously lost vehicle, including a required description field.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with user menu, navigation links, and conditional admin link based on backend checks.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches top-level render failures and displays a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback UI shown when an unrecoverable app error occurs, offering reload guidance.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to initiate a vehicle transfer by verifying PIN and generating a shareable transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Dialog prompting the user for a PIN with validation and submission handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap state with retry logic including exponential and continuous retries for stopped canisters.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin checks, first-admin onboarding, and admin-restricted queries and mutations.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend reachability via anonymous actor and returns basic diagnostics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and client initialization.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations to mark vehicles lost or found.",
  "frontend/src/hooks/useNotifications.ts": "Fetches user notifications and marks them as read with auto‑refresh.",
  "frontend/src/hooks/useOnboarding.ts": "Handles user onboarding with invite validation and error normalization.",
  "frontend/src/hooks/usePin.ts": "Provides PIN setup and update mutations.",
  "frontend/src/hooks/useProfile.ts": "Loads and updates the caller's user profile with identity‑scoped queries.",
  "frontend/src/hooks/useTransfers.ts": "Handles vehicle transfer initiation and acceptance with query invalidation.",
  "frontend/src/hooks/useVehicleCheck.ts": "Checks vehicle status by engine number using a backend call.",
  "frontend/src/hooks/useVehicles.ts": "Fetches and registers vehicles, including per‑vehicle queries.",
  "frontend/src/i18n/i18n.ts": "Empty file.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file.",
  "frontend/src/i18n/languages/ar.ts": "Empty file.",
  "frontend/src/i18n/languages/en.ts": "Empty file.",
  "frontend/src/i18n/languages/id.ts": "Empty file.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file.",
  "frontend/src/i18n/storage.ts": "Empty file.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Test file placeholder with no content.",
  "frontend/src/pages/AboutPage.tsx": "Displays app information, features, and admin contact details with branding.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page for entering and submitting a vehicle transfer code with validation and navigation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders admin-only dashboard with system statistics and handles access verification and errors.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Manages admin invite tokens, enabling creation, display, and copying of unused and used tokens.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user stats, quick actions, and navigation links using vehicle, report, and notification data.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Lists reported lost, stolen, or pawned vehicles with search and status badges.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications and allows marking them as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles user onboarding with invite tokens or first-admin claiming, collecting profile info and submitting it to complete registration.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the logged-in user's profile, allowing updates and logout via Internet Identity.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a vehicle, upload a photo with progress tracking, and submit details to the backend.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Allows users to create or update a PIN used for secure vehicle ownership transfers.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Lets users check a vehicle's status by engine number and displays details, photo, and status badge.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed vehicle info, status badges, and actions like transfers or lost reports for the selected vehicle.",
  "frontend/src/pages/VehiclesPage.tsx": "Shows the user's vehicles with status indicators and provides navigation to register or view individual vehicles.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Test file placeholder with no content.",
  "frontend/src/routes/RootRouteGate.tsx": "Controls authentication, onboarding redirects, and actor bootstrap error handling before rendering the app layout.",
  "frontend/src/test/setup.ts": "Test setup file placeholder with no content.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Test file placeholder with no content.",
  "frontend/src/utils/actorProxy.ts": "Wraps backend actor to safely handle access control initialization and avoid startup failures from bad admin tokens.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a stable React Query key for actor-related queries.",
  "frontend/src/utils/adminAllowlist.ts": "Provides a client-side allowlist check for admin principals and utilities to retrieve the list.",
  "frontend/src/utils/bootstrapError.ts": "Provides utilities to detect canister-stopped errors, extract technical error details, and classify bootstrap errors with guidance messages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters using both query strings and hash-based routing.",
  "frontend/src/version.ts": "Defines the application's version number and build date.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, container settings, and custom animations.",
  "frontend/vitest.config.ts": "Placeholder Vitest configuration file with no content.",
  "project_state.json": "Describes the project’s current state, issues, and feature requests related to fixing user onboarding and authorization flows."
}