{
  "backend/main.mo": "Motoko canister defining user profiles, vehicles, notifications, invite tokens, and admin/user permission helpers with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing PWA-related features, affected files, components, and test IDs with high-confidence entries.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, their behaviors, and recent feature integrations.",
  "frontend/.eslintrc.cjs": "ESLint configuration for TypeScript and React with custom rules and ignored patterns.",
  "frontend/.prettierrc.json": "Prettier formatting rules defining project-wide style settings.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Change‑control rules defining protected interfaces, backend API stability requirements, and mandatory review checklists.",
  "frontend/CHANGELOG.md": "Project changelog documenting PWA additions, vehicle ownership revocation, and initial release history.",
  "frontend/ci-run-gates.sh": "Shell script running all frontend quality gates via npm.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying base background and border styles.",
  "frontend/index.html": "HTML entry file configuring PWA metadata, icons, manifest, and mounting the React app.",
  "frontend/PR_CHECKLIST.md": "Pull‑request checklist enforcing change‑control policy, testing, documentation, and quality gate verification.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, categories, and launch settings.",
  "frontend/public/sw.js": "Service worker implementing cache management with network-first and cache-first strategies and exclusions for PWA assets.",
  "frontend/QUALITY_GATES.md": "Documentation describing automated frontend quality gates and how to run them.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how developers should follow the project's change‑control system.",
  "frontend/README_VERSIONING.md": "Semantic versioning guide describing release version rules for the project.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up React Query, TanStack Router routes, and initializes the app structure and service worker registration.",
  "frontend/src/components/activation/VehicleRegistrationActivationCard.tsx": "UI card for viewing activation status and redeeming vehicle registration activation tokens with form handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with navigation back to the dashboard and admin info alert.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Error screen showing profile load failures with canister diagnostics, backend health checks, and copyable error details.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders the Internet Identity sign‑in interface with branding, feature highlights, and a login button.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Displays detailed startup error diagnostics with retry handling, backend health checks, and clipboard copy support.",
  "frontend/src/components/brand/AppLogo.tsx": "Shows the application logo at configurable sizes using a static image asset.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder file for a future language selection component.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with conditional header, footer, navigation routing, and PWA install banner.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, stolen, or pawned with category selection and note input.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for submitting a found‑vehicle report with a required description.",
  "frontend/src/components/nav/AppHeader.tsx": "Renders the top navigation bar with routes, user menu, admin access, and mobile menu support.",
  "frontend/src/components/pwa/InstallAppBanner.tsx": "Displays an install‑prompt banner for PWA installation when the app is installable.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Catches uncaught render errors and shows a fallback screen instead of crashing the app.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Displays a full‑screen fallback UI for fatal app errors with guidance and a reload button.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Handles starting a vehicle transfer by verifying a PIN and generating a transfer code with copy‑link support.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Modal dialog prompting for a PIN with validation, error display, and async submit handling.",
  "frontend/src/components/vehicle/VehiclePhotoSection.tsx": "Shows a vehicle photo with graceful fallback if loading fails.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing and invalidating dependent queries on change.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap errors with bounded and continuous retry logic and exposes retry state.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin‑related queries and mutations including admin checks, invite codes, and activation token generation.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend diagnostics using an anonymous actor to report reachability and build info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via a React context.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks for fetching lost vehicles and marking vehicles lost or found with cache invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Provides hooks to fetch user notifications and mark them as read with periodic polling.",
  "frontend/src/hooks/useOnboarding.ts": "Mutation hook for completing onboarding with detailed logging and query invalidation.",
  "frontend/src/hooks/usePin.ts": "Hooks for checking, setting, and updating a user's PIN using actor calls.",
  "frontend/src/hooks/useProfile.ts": "Hooks to fetch and update the caller's user profile with identity-aware caching.",
  "frontend/src/hooks/useTransfers.ts": "Hooks to initiate and accept vehicle transfers and refresh related vehicle data.",
  "frontend/src/hooks/useVehicleCheck.ts": "Mutation hook to check a vehicle's status by engine number.",
  "frontend/src/hooks/useVehicleRegistrationActivation.ts": "Hooks for checking activation status and redeeming activation tokens for vehicle registration.",
  "frontend/src/hooks/useVehicles.ts": "Hooks for fetching user vehicles, fetching a single vehicle, registering vehicles, and revoking ownership.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder for i18n configuration.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file placeholder for i18n provider setup.",
  "frontend/src/i18n/languages/ar.ts": "Empty file for Arabic translation data.",
  "frontend/src/i18n/languages/en.ts": "Empty file for English translation data.",
  "frontend/src/i18n/languages/id.ts": "Empty file for Indonesian translation data.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file for Simplified Chinese translation data.",
  "frontend/src/i18n/storage.ts": "Empty file likely intended for language storage utilities.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "App entry mounting React, query client provider, and Internet Identity provider.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder for VehiclesPage fetch-flow tests.",
  "frontend/src/pages/AboutPage.tsx": "UI page describing the app, features, and admin contact details.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page allowing users to enter a transfer code and accept a vehicle transfer, with validation and mutation handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system stats, admin access verification, and error handling for admin and stats fetches.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page for generating activation tokens for user vehicle registration, including validation and clipboard actions.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing counts of vehicles, notifications, and reported vehicles, plus quick navigation actions.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays a searchable list of lost, stolen, or pawned vehicles with status badges and report details.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with timestamps and allows marking individual alerts as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Empty placeholder page for onboarding via invite.",
  "frontend/src/pages/OnboardingPage.tsx": "User onboarding form collecting profile info and handling first-admin setup logic.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page enabling editing user info, managing PIN setup/update, and showing activation status.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form page for registering a new vehicle, handling photo upload, activation checks, and submission via registerVehicle hook.",
  "frontend/src/pages/ReportFoundVehiclePage.tsx": "Page for checking a vehicle by engine number and submitting a found-vehicle report when eligible.",
  "frontend/src/pages/RevokeOwnershipPage.tsx": "Interface allowing users to revoke ownership of their active vehicles with PIN confirmation.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Security settings page for creating or updating the user's transfer PIN with validation and status alerts.",
  "frontend/src/pages/VehicleCheckPage.tsx": "Page to check vehicle status by engine number and display alerts, badges, photos, and report options.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information for a specific vehicle, including status, ownership actions, and revoke workflow with PIN verification.",
  "frontend/src/pages/VehiclesPage.tsx": "Shows the user's vehicle list with status badges and provides actions for registration based on activation state.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker in production and handles update detection for PWA support.",
  "frontend/src/pwa/usePwaInstallPrompt.ts": "React hook managing the PWA install prompt, user dismissal logic, and triggering installation.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test placeholder for RootRouteGate.",
  "frontend/src/routes/RootRouteGate.tsx": "Gates the root route by handling auth state, profile loading, and actor bootstrap errors with redirects and loading screens.",
  "frontend/src/test/setup.ts": "Test setup file with no content.",
  "frontend/src/utils/__tests__/bootstrapError.test.ts": "Empty test placeholder for bootstrap error utilities.",
  "frontend/src/utils/actorProxy.ts": "Wraps backend actors to safely handle admin access control initialization and prevent startup traps.",
  "frontend/src/utils/actorQueryKey.ts": "Provides a canonical React Query key for actor-related queries.",
  "frontend/src/utils/adminAllowlist.ts": "Defines and checks a client-side allowlist of admin principals.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, detects stopped-canister cases, and formats guidance and technical details.",
  "frontend/src/utils/normalizeActorError.ts": "Normalizes actor call errors into user-safe messages with categorized error types.",
  "frontend/src/utils/onboardingTroubleshooting.ts": "Empty utility placeholder for onboarding troubleshooting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/src/version.ts": "Defines the application's version and build timestamp.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with theme extensions, plugins, and color system definitions.",
  "frontend/vitest.config.ts": "Empty Vitest configuration placeholder.",
  "project_state.json": "Defines the project's state and requirements for fixing the PWA mobile install experience, including issues with install prompts and icons. Lists existing PWA-related features, a new fix request, and project metadata."
}