{
  "backend/main.mo": "Motoko backend actor defining user profiles, vehicles, notifications, access control, storage mixins, and invite link APIs.",
  "feature_evidence.json": "Feature evidence report listing affected files, components, and test IDs for rebuild, redeploy, and startup retry-flow verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files, components, hooks, and pages used across the app.",
  "frontend/index.css": "Tailwind CSS base layer with light/dark theme color variables and global element styles.",
  "frontend/index.html": "HTML entry point configuring PWA manifest, icons, metadata, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, categories, and display settings.",
  "frontend/public/sw.js": "Service worker implementing caching strategy with network-first HTML handling and selective asset caching.",
  "frontend/src/App.tsx": "Main React router and app shell defining routes, layout, authentication gating, and bootstrap error handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied page and allows eligible users to claim first admin access by submitting profile data.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Shows detailed profile-loading errors, classifies the failure type, and offers retry and error-copy options.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders an Internet Identity sign‑in screen with branding and security benefit explanations.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Displays startup initialization errors with guidance and a retry button.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo in multiple size options.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with conditional header/footer based on authentication and route.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for reporting a vehicle as lost, requiring a note and submitting via mutation.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for reporting a found vehicle, collecting a finder report and submitting it.",
  "frontend/src/components/nav/AppHeader.tsx": "Navigation header with user menu, admin-aware links, and logout handling using identity and profile hooks.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches top-level render failures and displays a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback screen showing an error message and reload option when the app crashes.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to start a vehicle transfer, prompting for PIN and generating a transfer code and shareable link.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Dialog that collects a PIN, handles submission state, and displays errors.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Hook exposing actor initialization status with retry logic and query reset.",
  "frontend/src/hooks/useAdmin.ts": "Admin-related hooks for checking admin status, onboarding, system stats, invite codes, and registered vehicles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks to manage Internet Identity authentication using AuthClient, including login, logout, and status tracking.",
  "frontend/src/hooks/useLostVehicles.ts": "Defines React Query hooks for fetching lost vehicles and marking vehicles as lost or found via the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "Adds hooks to retrieve user notifications with polling and to mark notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Implements a mutation hook to complete user onboarding and refresh the current user profile.",
  "frontend/src/hooks/usePin.ts": "Exposes mutations for setting up and updating a user's PIN through the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Provides hooks to load and save the caller's user profile, keyed by Internet Identity principal.",
  "frontend/src/hooks/useTransfers.ts": "Adds hooks for initiating and accepting vehicle transfers and invalidating related queries on success.",
  "frontend/src/hooks/useVehicles.ts": "Includes hooks for fetching user vehicles, fetching a single vehicle, and registering new vehicles with cache updates.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Displays application information, features, and admin contact details with styled UI components.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page for accepting a vehicle transfer using a transfer code, handling validation and success navigation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system statistics and navigation to admin management sections.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page for viewing, generating, and copying invite tokens with usage indicators.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user stats (vehicles, lost vehicles, notifications) and provides quick navigation actions on the dashboard.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Shows a searchable list of reported lost vehicles with details, images, and a dialog for reporting found vehicles.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications, allows marking them as read, and handles loading and empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles user onboarding via invite token and profile form submission, then completes account setup.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile information with save and logout functionality.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a new vehicle, including photo upload with progress tracking.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Page for creating and updating a user's PIN with validation and success/error handling.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information about a selected vehicle, including status, photo, metadata, and owner actions.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists the user's registered vehicles with status badges and navigation to registration or detail pages.",
  "frontend/src/utils/actorProxy.ts": "Creates a safe proxy around the backend actor to gracefully handle admin access initialization failures.",
  "frontend/src/utils/actorQueryKey.ts": "Utility for generating consistent React Query keys for actor-related queries.",
  "frontend/src/utils/bootstrapError.ts": "Provides helpers to extract, classify, and format bootstrap errors, including detection of canister-stopped, network, auth, and unknown issues.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL and hash parameters, persisting them in sessionStorage, and clearing them for routing and state management.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, container settings, animations, and plugin usage.",
  "project_state.json": "Stores the project’s current state, including summary, architecture notes, known issues, and feature tracking metadata."
}