{
  "backend/main.mo": "Motoko canister defining user profiles, admin authorization (including allowlisted admin), invite-link management, and vehicle records with notifications.",
  "feature_evidence.json": "Feature evidence report listing admin-allowlist, admin-data-flow, and invite-token features with related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend components, hooks, pages, and infrastructure behavior.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark color variables and base element styles.",
  "frontend/index.html": "HTML entry point setting meta tags, PWA manifest, icons, and mounting the React root with main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and categories.",
  "frontend/public/sw.js": "Service worker implementing cache management with network-first HTML and cache-first static asset strategies.",
  "frontend/src/App.tsx": "Main React router setup defining all application routes and wrapping the app in ThemeProvider and Toaster.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message and optionally allows eligible users to claim first admin access by submitting profile info.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Shows detailed profile loading errors with classification-based guidance and options to copy error details or retry.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders the Internet Identity sign‑in screen with app branding and security feature highlights.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Displays startup initialization errors with troubleshooting tips and a retry button.",
  "frontend/src/components/brand/AppLogo.tsx": "Shows the app logo image in configurable sizes.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps app pages with optional header and footer based on authentication and onboarding state.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog allowing users to report a vehicle as lost with required notes and mutation handling.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for submitting a found‑vehicle report with user‑provided details and mutation handling.",
  "frontend/src/components/nav/AppHeader.tsx": "Navigation header component that renders main routes, user menu, and admin link handling based on identity and admin status.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches top-level render errors and shows a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback screen shown on critical app errors with guidance and a reload button.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to initiate a vehicle transfer, prompting for PIN and showing a generated transfer code and shareable link.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "Reusable dialog prompting the user for a PIN with validation and error display.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Hook exposing actor initialization state with error detection and a retry mechanism.",
  "frontend/src/hooks/useAdmin.ts": "Admin‑related hooks for checking admin status, onboarding the first admin, and fetching admin‑restricted data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login state, loading identities, and creating AuthClient instances.",
  "frontend/src/hooks/useLostVehicles.ts": "Exports hooks to fetch lost vehicles, mark a vehicle as lost, and report a vehicle as found using react-query mutations.",
  "frontend/src/hooks/useNotifications.ts": "Implements hooks for retrieving current user notifications and marking them as read with react‑query.",
  "frontend/src/hooks/useOnboarding.ts": "Contains a mutation hook to complete user onboarding and refresh the current user profile.",
  "frontend/src/hooks/usePin.ts": "Provides mutation hooks to set up or update a user PIN through actor calls.",
  "frontend/src/hooks/useProfile.ts": "Offers hooks to fetch and save the caller's user profile, keyed by the current Internet Identity principal.",
  "frontend/src/hooks/useTransfers.ts": "Defines mutations to initiate and accept vehicle transfers and invalidates related queries on success.",
  "frontend/src/hooks/useVehicles.ts": "Includes hooks to fetch user vehicles, fetch a specific vehicle, and register new vehicles with react‑query caching.",
  "frontend/src/index.css": "Tailwind base stylesheet defining color variables, dark mode theme, and global styles.",
  "frontend/src/main.tsx": "Application entry file setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an informational About page describing the app, its features, and admin contact details.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Page for accepting a vehicle transfer by entering a code, handling form submission and success/error states.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin-only dashboard that verifies access and displays system statistics such as vehicles, reports, and users.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin interface for generating, viewing, and copying invite tokens, with access control and token status sections.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing vehicle, lost vehicle, and notification stats with quick actions and navigation.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Lists reported lost vehicles with search filtering and a detail card display.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications and allows marking items as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles user onboarding via invite token and profile form submission.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user's profile with form-based updates and logout support.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form for registering a new vehicle including photo upload with progress tracking.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Provides UI and logic for creating or updating a PIN, including validation and form handling.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information about a specific vehicle with status badges and owner-specific actions.",
  "frontend/src/pages/VehiclesPage.tsx": "Shows the user's registered vehicles with status indicators and navigation to registration or detail pages.",
  "frontend/src/routes/RootRouteGate.tsx": "Handles auth, profile loading, admin allowlist checks, and redirects; shows loading or error screens until the app is ready.",
  "frontend/src/utils/actorProxy.ts": "Wraps backend actors to safely handle admin access-control initialization and suppress invalid-token errors.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a consistent React Query key for actor-related queries using the caller’s principal.",
  "frontend/src/utils/adminAllowlist.ts": "Provides a fixed admin principal allowlist check and exposes the hardcoded admin ID.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, extracts technical messages, and formats them for display or clipboard use.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters, including persistence, retrieval, and cleanup of sensitive values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and container settings for the frontend build.",
  "project_state.json": "Captures project metadata, architecture notes, known issues, and feature tracking for the application."
}