{
  "backend/main.mo": "Motoko canister implementing authorization, onboarding, invite codes, user profiles, notifications, vehicle management, and storage features.",
  "feature_evidence.json": "Structured feature evidence report mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their roles in routing, UI, hooks, and PWA setup.",
  "frontend/index.css": "Tailwind CSS configuration defining light and dark theme variables and applying global styles.",
  "frontend/index.html": "HTML entry point setting up metadata, PWA manifest, icons, and loading the main React bundle.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, categories, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing basic caching, fetch handling, and cache version management for offline support.",
  "frontend/src/App.tsx": "Main React routing setup with authentication gating and route definitions for all app pages including admin and About.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when users lack permissions, providing a dashboard link and admin setup guidance.",
  "frontend/src/components/auth/SignInScreen.tsx": "Displays the sign‑in screen using Internet Identity with branding and security feature highlights.",
  "frontend/src/components/brand/AppLogo.tsx": "Renders the application logo in configurable sizes.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with layout, showing header and footer based on authentication and onboarding state.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for submitting a report marking a vehicle as lost with validation and mutation handling.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for reporting a found vehicle, submitting finder details via mutation.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with logo, navigation links, notifications, user menu, and admin access checks.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Handles initiating a vehicle transfer requiring PIN verification and showing the generated transfer code.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "PIN entry dialog used to verify sensitive actions with error handling and submission flow.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdmin.ts": "React Query hooks for admin actions like checking admin status, fetching system stats, invite codes, and registered vehicles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks for retrieving lost vehicles and marking vehicles as lost or found with cache invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Hooks to fetch user notifications with polling and mark notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Mutation hook to complete user onboarding and refresh the user profile cache.",
  "frontend/src/hooks/usePin.ts": "Hooks to set up or update a user's PIN via actor mutations.",
  "frontend/src/hooks/useProfile.ts": "Hooks to load and pseudo-save the caller's user profile, mainly triggering onboarding flow.",
  "frontend/src/hooks/useTransfers.ts": "Hooks for initiating and accepting vehicle transfers with related cache updates.",
  "frontend/src/hooks/useVehicles.ts": "Hooks for user vehicle retrieval, single vehicle lookup, and registering a new vehicle.",
  "frontend/src/index.css": "Tailwind CSS base configuration with custom theme variables and dark mode values.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "UI page describing the app, its features, and admin contact info with navigation support.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Form page allowing users to enter a transfer code and accept vehicle ownership, with validation and success/error handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system stats and links to manage invite tokens and view all vehicles.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin interface to generate, view, and manage invite tokens, including copying invite links and viewing usage status.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing counts of user vehicles, lost vehicles, and notifications, plus quick actions and admin-aware system info.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Displays a searchable list of reported lost vehicles with details and status tags, including loading and empty states.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with timestamps and allows marking them as read, handling loading and empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Onboarding form where new users submit an invite token and profile details to complete account setup.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page showing Internet Identity principal details with a notice that profile updates require admin assistance.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Form page for registering a new vehicle with photo upload, field inputs, and submission to the registerVehicle mutation.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Page for creating or updating a security PIN with validation and form handling.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Displays detailed information about a vehicle, including status, photo, and owner actions like transfers or lost reporting.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists all vehicles owned by the user with status badges and navigation to details or registration.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and clearing them from hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, typography, animations, and plugin setup for the frontend.",
  "project_state.json": "JSON project state describing app goals, architecture notes, known issues, required images, and implemented features."
}