{
  "backend/main.mo": "Main backend actor defining user profiles, vehicle tracking, notifications, admin‑gated invite code generation, and onboarding logic with authorization and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs with high‑confidence analysis.",
  "frontend-file-summaries.txt": "Collection of short summaries for multiple frontend files describing their roles in authentication, layout, profile handling, admin tools, and PWA setup.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables, base styles, and global color tokens.",
  "frontend/index.html": "Main HTML entry point loading the React app with PWA manifest, icons, and meta tags.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, categories, and locale settings.",
  "frontend/public/sw.js": "Service worker implementing basic caching, fetch interception, and cache cleanup for offline support.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, and an authentication gate that manages profile loading and redirect behavior.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen for unauthorized access with optional first‑admin claim flow and navigation actions.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Displays a styled error card when user profile loading fails, showing error details and a retry button.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders the login screen with Internet Identity authentication and feature highlights.",
  "frontend/src/components/brand/AppLogo.tsx": "Shows the application logo at configurable sizes using a static image asset.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with header and footer, conditionally showing navigation based on authentication and onboarding state.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Provides a dialog for reporting a vehicle as lost with a required note and submission to backend.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Allows users to submit a report that a lost vehicle was found, including a required description.",
  "frontend/src/components/nav/AppHeader.tsx": "Displays the main navigation header with user menu, mobile menu, and dynamic admin links.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Handles initiating a vehicle transfer via PIN verification and shows the resulting transfer code with copy link option.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "A dialog prompting for a PIN, handling submission state and showing validation errors.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin‑related queries and mutations including checking admin status, claiming first admin, fetching system stats, invite codes, and registered vehicles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading identities, handling login/logout, and exposing identity context to the app.",
  "frontend/src/hooks/useLostVehicles.ts": "Fetches lost vehicles and provides mutations to mark vehicles as lost or found with appropriate query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Fetches user notifications with polling and provides a mutation to mark notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Handles onboarding completion by submitting invite tokens and profile data, then refreshing the user profile cache.",
  "frontend/src/hooks/usePin.ts": "Provides mutations to set up or update a user's PIN using the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Retrieves caller profile based on inferred user role and exposes a stub mutation for profile updates, which are handled during onboarding.",
  "frontend/src/hooks/useTransfers.ts": "Supports initiating and accepting vehicle transfers and invalidates related vehicle and user queries.",
  "frontend/src/hooks/useVehicles.ts": "Fetches user and individual vehicle data and provides vehicle registration with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes with styling tokens.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with app description, feature highlights, and admin contact links. Includes navigation back to home and presentation components.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Provides a form for entering a transfer code to accept vehicle ownership. Handles submission, validation, success navigation, and error alerts.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying system stats and navigation to manage invite tokens or view all vehicles.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin page that lists invite tokens, generates new ones, and allows copying onboarding links with admin-access checks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user dashboard with vehicle, lost vehicle, and notification stats plus quick-action buttons. Fetches user data and provides navigation shortcuts.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Shows a searchable list of reported lost vehicles with details and images. Supports filtering, loading state, and vehicle card rendering.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with timestamps and unread indicators. Allows marking notifications as read and handles loading and empty states.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Form for completing onboarding using an invite token and profile details. Submits data to create an account and navigates on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user’s profile info from hooks and shows Internet Identity details with logout support.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a new vehicle, including photo upload with progress tracking.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Allows users to create or update a security PIN used for vehicle ownership transfers.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed information about a specific vehicle, its status, and actions like reporting lost or initiating transfer.",
  "frontend/src/pages/VehiclesPage.tsx": "Lists all vehicles owned by the user with status badges and navigation to registration or details.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters using both query strings and hash routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, fonts, animations, and enabled plugins.",
  "project_state.json": "Project state file describing app purpose, architecture notes, known issues, and existing feature records."
}