{
  "backend/main.mo": "Primary backend canister implementing authorization, storage, invite links, user profiles, notifications, and vehicle management with admin checks and shared methods.",
  "backend/migration.mo": "Migration module defining persisted types and a no-op run function that returns the old actor state.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing various frontend files and components across the project.",
  "frontend/.eslintrc.cjs": "ESLint configuration enabling TypeScript, React, and hooks rules with basic quality warnings and ignore patterns.",
  "frontend/.prettierrc.json": "Prettier formatting configuration defining style rules such as quotes, trailing commas, and print width.",
  "frontend/CHANGE_CONTROL_POLICY.md": "Defines stable interfaces, required review steps, backend API constraints, and verification rules for all changes.",
  "frontend/CHANGELOG.md": "Project changelog documenting releases, added features, protected interfaces, and version history.",
  "frontend/ci-run-gates.sh": "Shell script that runs all frontend quality gates in CI by executing npm run gates.",
  "frontend/index.css": "Tailwind base setup defining light and dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/index.html": "HTML entry point loading the PWA manifest, icons, and mounting the React app via main.tsx.",
  "frontend/PR_CHECKLIST.md": "Pull request checklist enforcing change‑control compliance, quality gates, testing, and documentation updates.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, categories, and display settings.",
  "frontend/public/sw.js": "Service worker implementing caching strategy with network-first navigation and cache-first static assets, plus cache versioning.",
  "frontend/QUALITY_GATES.md": "Documentation describing automated frontend quality gates and how to run them.",
  "frontend/README_CHANGE_CONTROL.md": "Guide explaining how developers should use the project’s change-control system during feature work.",
  "frontend/README_VERSIONING.md": "Documentation outlining the project's semantic versioning process and version update rules.",
  "frontend/src/__tests__/router-smoke.test.tsx": "Empty test file placeholder for router smoke tests.",
  "frontend/src/App.tsx": "Sets up the router with all application routes and wraps the app with theme provider and toaster.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI allowing users without access to see an error and optionally claim first-admin rights by submitting profile info.",
  "frontend/src/components/auth/ProfileBootstrapError.tsx": "Error screen displaying profile-load failures with classification, guidance, retry and copy-to-clipboard options.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign‑in screen using Internet Identity with branding, feature highlights, and a login button.",
  "frontend/src/components/auth/StartupBootstrapError.tsx": "Error screen component that classifies bootstrap errors, supports auto‑retry UI, and allows copying formatted error details.",
  "frontend/src/components/brand/AppLogo.tsx": "Displays the app logo at configurable sizes using a static image asset.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper that shows header and footer based on authentication state and renders children content.",
  "frontend/src/components/lost/MarkLostDialog.tsx": "Dialog for submitting a vehicle‑lost report with validation and mutation handling.",
  "frontend/src/components/lost/ReportFoundDialog.tsx": "Dialog for reporting a found vehicle, submitting a finder note, and closing on success.",
  "frontend/src/components/nav/AppHeader.tsx": "Top navigation bar with routing, user menu, mobile menu, and conditional admin links.",
  "frontend/src/components/system/TopLevelErrorBoundary.tsx": "Error boundary that catches unexpected errors and renders a fallback UI.",
  "frontend/src/components/system/TopLevelErrorFallback.tsx": "Fallback screen showing a basic error message and reload button for top‑level failures.",
  "frontend/src/components/transfer/InitiateTransferPanel.tsx": "Panel to initiate vehicle transfer requiring PIN verification and showing the resulting transfer code with copy support.",
  "frontend/src/components/transfer/PinPromptDialog.tsx": "A dialog component that prompts the user for a PIN, handles submission, and shows errors or loading state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorBootstrapStatus.ts": "Tracks actor bootstrap loading/error state with bounded auto-retries and manual retry support.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations including admin checks, first-admin onboarding, system stats, and invite code management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login/logout functions, and login status via context.",
  "frontend/src/hooks/useLostVehicles.ts": "Hooks to query lost vehicles and mutate lost/found vehicle reports with appropriate cache invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Fetches user notifications with polling and allows marking notifications as read.",
  "frontend/src/hooks/useOnboarding.ts": "Provides a mutation to complete user onboarding and refresh profile data.",
  "frontend/src/hooks/usePin.ts": "Mutations for setting up and updating a user PIN via the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Queries and updates the caller's user profile, keyed to the current identity.",
  "frontend/src/hooks/useTransfers.ts": "Provides mutations to initiate and accept vehicle transfers, invalidating related vehicle queries on success.",
  "frontend/src/hooks/useVehicles.ts": "Defines React Query hooks for fetching user vehicles, a single vehicle, and registering new vehicles via an actor API.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder for core i18n configuration.",
  "frontend/src/i18n/I18nProvider.tsx": "Empty file placeholder for the i18n provider component.",
  "frontend/src/i18n/languages/ar.ts": "Empty file placeholder for Arabic translations.",
  "frontend/src/i18n/languages/en.ts": "Empty file placeholder for English translations.",
  "frontend/src/i18n/languages/id.ts": "Empty file placeholder for Indonesian translations.",
  "frontend/src/i18n/languages/zh-Hans.ts": "Empty file placeholder for Simplified Chinese translations.",
  "frontend/src/i18n/storage.ts": "Empty file placeholder for i18n persistence utilities.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx": "Empty test file placeholder.",
  "frontend/src/pages/AboutPage.tsx": "Renders the app’s about page with descriptions, features, and admin contact info.",
  "frontend/src/pages/AcceptTransferPage.tsx": "Provides a form for users to accept vehicle transfers using a transfer code.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing system statistics and handling admin access validation with error and loading states.",
  "frontend/src/pages/admin/AdminInviteTokensPage.tsx": "Admin interface to generate, list, and manage invite tokens with copy-to-clipboard support and access checks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user stats, quick actions, and system info on the main dashboard.",
  "frontend/src/pages/LostVehiclesPage.tsx": "Shows a searchable list of lost vehicles with details and report actions.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications and allows marking them as read.",
  "frontend/src/pages/OnboardingInvitePage.tsx": "Handles invite-based onboarding, preventing admins from using the form and submitting profile data tied to an invite token.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the user's profile, allowing updates and logout through Internet Identity.",
  "frontend/src/pages/RegisterVehiclePage.tsx": "Provides a form to register a new vehicle, including uploading a photo with progress tracking.",
  "frontend/src/pages/SecuritySettingsPage.tsx": "Manages creating and updating the user’s security PIN with validation and mutation hooks.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows full vehicle details, including status and photo, with owner‑only actions for transfer and lost reporting.",
  "frontend/src/pages/VehiclesPage.tsx": "Displays the user's registered vehicles with status badges and navigation to vehicle details or registration.",
  "frontend/src/routes/__tests__/RootRouteGate.test.tsx": "Empty test file placeholder.",
  "frontend/src/routes/RootRouteGate.tsx": "Handles authentication, profile bootstrap, admin bypass rules, and redirects before rendering the main app layout.",
  "frontend/src/test/setup.ts": "Empty test setup file placeholder.",
  "frontend/src/utils/actorProxy.ts": "Creates a safe actor proxy that handles admin token initialization errors without blocking app startup.",
  "frontend/src/utils/actorQueryKey.ts": "Generates a canonical React Query key for actor-related queries.",
  "frontend/src/utils/adminAllowlist.ts": "Provides utilities for checking and retrieving allowlisted admin principals.",
  "frontend/src/utils/bootstrapError.ts": "Classifies bootstrap errors, detects stopped-canister cases, and generates user guidance messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/version.ts": "Defines the app’s version and build date constants.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "frontend/vitest.config.ts": "Empty Vitest config placeholder.",
  "project_state.json": "Project metadata tracking version, issues, features, and new feature requests for change‑control improvements."
}