{
  "kind": "build_request",
  "title": "Fix admin bootstrap visibility, make profile data loadable, and add Logout button on Profile",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Fix the user profile data flow so signed-in users are not incorrectly forced into onboarding, and so the Profile feature reliably appears and works after sign-in.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "INI KOK BELUM MUNCUL JUGA DASHBOARD  ADMIN DAN FITUR PROFIL PENGGUNA ..."
        ]
      },
      "acceptanceCriteria": [
        "When a user is signed in and has already completed onboarding, the app does not redirect them to the onboarding page.",
        "The frontend `useGetCallerUserProfile` hook fetches the current caller profile from the backend (instead of always returning `null`).",
        "The Profile page can be opened at route `/profile` after sign-in and displays the correct user profile data (full name, email, city, country) sourced from the backend.",
        "If the backend returns that the user is not onboarded / no profile exists, the app routes the user to onboarding as it does today."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add a Logout button inside the Profile page that logs the user out of Internet Identity and clears cached app state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Tambahkan juga di fitur PROFILE PENGGUNA TOMBOL LOGOUT",
          "2. Iya tombol logout ada di fitur profile pengguna."
        ]
      },
      "acceptanceCriteria": [
        "The Profile page contains a clearly labeled \"Logout\" button.",
        "Clicking \"Logout\" calls the existing Internet Identity logout/clear logic and clears React Query cache (consistent with the existing header logout behavior).",
        "After logout, the user is returned to the signed-out experience (SignIn screen) and protected routes are not accessible until signing in again."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Ensure the Profile page displays the signed-in user’s Internet Identity Principal ID as read-only text so users can see their Internet ID.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "KAN MASUKKAN MENGGUNAKAN PRICIPLE ID, BAGAIMANA PENGGUNA AKAN TAHU INTERNET ID NYA?",
          "1. Iya."
        ]
      },
      "acceptanceCriteria": [
        "The Profile page shows a read-only \"Principal ID\" field populated from the current identity principal string.",
        "If the identity is temporarily unavailable, the UI shows an appropriate fallback state (e.g., empty state or loading) without crashing."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Implement a robust \"claim first admin\" bootstrap that works reliably so the current signed-in user can claim admin and then immediately see the Admin menu and access the Admin Dashboard.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Anda saja yang menambahkan ulang flow nya agar saya klaim sebagai admin",
          "Reset/tambahkan ulang flow klaim 'first admin' agar pengguna bisa klaim admin saat ini dan menu Admin/Dashboard muncul"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an explicit way to determine whether \"first admin\" can be claimed (based on whether any admin exists), rather than relying on guessing via unauthorized errors from admin-only APIs.",
        "Backend exposes a dedicated method to claim first admin that assigns the admin role to the caller only when no admin exists; otherwise it must fail safely.",
        "Frontend AccessDeniedScreen uses the new backend capability check and claim method to show a \"Claim admin access\" action only when it is truly available.",
        "After successfully claiming admin, the Admin navigation entry becomes visible without a full refresh, and `/admin` becomes accessible to the claimant immediately."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Make the admin navigation entry reliably appear for admin users (desktop nav and mobile nav), based on the backend admin check, and ensure the Admin Dashboard route is reachable for admins.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "INI KOK BELUM MUNCUL JUGA DASHBOARD  ADMIN ..."
        ]
      },
      "acceptanceCriteria": [
        "When the signed-in principal is an admin, the header shows an \"Admin\" navigation entry in both desktop and mobile menus.",
        "When the signed-in principal is not an admin, the \"Admin\" navigation entry is not shown.",
        "Navigating to `/admin` as an admin successfully renders the admin dashboard page; navigating as a non-admin shows an access denied experience."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; keep logic in `backend/main.mo` (generate `backend/migration.mo` only if state migration is truly required).",
    "Do not edit any frontend files under `frontend/src/components/ui` (shadcn components are read-only) and do not edit any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "All user-facing text added/changed by this request must be in English."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding new database services or external backends.",
    "Changing the invitation-token onboarding product rules beyond fixing the incorrect profile/onboarding detection.",
    "Redesigning unrelated pages or adding new app modules not mentioned in the request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}