{
  "kind": "build_request",
  "title": "Make the current Internet Identity principal an admin and bypass onboarding/registration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the client-side admin allowlist so the user’s Internet Identity principal `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae` is treated as an admin for onboarding-bypass checks (and structure the allowlist so it can support more than one principal without code churn).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "LANJUT DEOLOY"
        ]
      },
      "acceptanceCriteria": [
        "`isAllowlistedAdmin(...)` returns true for `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`.",
        "Allowlist logic is not limited to a single hardcoded string (e.g., uses a list/array/set internally)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change routing/bootstrap behavior so an admin user is never forced into the onboarding/registration flow. Specifically: when the authenticated principal is admin (including the allowlisted admin), do not redirect to `/onboarding` even if `getCallerUserProfile()` returns `null`, and ensure the app lands on a usable authenticated route (e.g., `/` or `/admin`) without showing the onboarding form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "SAYA INI KAN ADMIN JADI TIDAK PERLU DAFTAR",
          "LANJUT DEOLOY"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`, the app does not navigate to `/onboarding` automatically.",
        "If the user manually visits `/onboarding` while already recognized as admin, the app prevents completing the invite-based onboarding flow and instead routes them back to a main page (e.g., dashboard/admin).",
        "Admin navigation (e.g., the Admin link) is accessible for the allowlisted/admin principal without completing onboarding."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update backend authorization so the allowlisted admin principal can be treated as an admin immediately (without requiring onboarding/profile completion), enabling admin APIs that currently rely on `hasAdminPermission` and preventing the ‘admin must register’ dead-end after a reinstall. Keep the allowlisted admin principal value exactly as `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "SAYA INI KAN ADMIN JADI TIDAK PERLU DAFTAR",
          "force-redeploy full (install_code mode reinstall)"
        ]
      },
      "acceptanceCriteria": [
        "After a reinstall (state reset), calls that require admin permission (e.g., generating invite codes, viewing invite codes) succeed for the allowlisted admin principal without requiring `completeOnboarding(...)` first.",
        "Backend admin checks used by the frontend (e.g., `isCallerAdmin()` and/or `isAllowlistAdmin()`/`isAllowlistAdmin`-style checks if present) return admin=true for the allowlisted admin principal immediately after deploy.",
        "No backend schema/state migration is required to support this change (behavior-only change)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit any files under `frontend/src/components/ui` or the immutable hook entrypoints listed in SYSTEM_CONTEXT.",
    "Use English for any new/modified user-facing UI strings introduced as part of these changes."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity).",
    "Implementing a new database or external storage.",
    "Changing unrelated UI copy across the entire app (only update text where required by the admin/onboarding fix)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}