{
  "kind": "build_request",
  "title": "Rebuild and redeploy to recover from stopped backend canister (IC0508)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-55",
      "text": "Trigger a rebuild and redeploy of the existing application (no functional changes required) to restart the backend canister that is currently stopped and causing replica rejection errors (IC0508) during startup.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "\"ya, build ulang\""
        ]
      },
      "acceptanceCriteria": [
        "A new build and deployment completes successfully.",
        "After deployment, opening the app no longer fails with replica rejection IC0508 / \"Canister ... is stopped\" during startup initialization.",
        "The app renders past the startup screen and shows the expected Sign In screen for unauthenticated users."
      ]
    },
    {
      "id": "REQ-56",
      "text": "After redeploy, verify that the startup retry flow remains functional: when a connection error occurs, the 'Retry Connection' action must attempt actor initialization again and must not leave the UI stuck on a loading spinner indefinitely.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Cukup jawab: \"ya, build ulang\" dan saya akan langsung buat versi baru untuk menghidupkan kembali aplikasi kamu.",
          "\"ya, build ulang\""
        ]
      },
      "acceptanceCriteria": [
        "If actor initialization fails, the Startup Bootstrap Error screen is shown (not a blank screen).",
        "Clicking 'Retry Connection' triggers a fresh initialization attempt and either recovers to normal app flow or re-shows an error screen with the latest error message."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable frontend hook paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state migration is required (not expected for a rebuild-only deploy)."
  ],
  "nonGoals": [
    "No new product features or UI redesign beyond what is necessary to validate the rebuild/redeploy recovery.",
    "No changes to data models, authorization rules, or invite/onboarding logic unless required to complete deployment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}