{
  "kind": "build_request",
  "title": "Fix infinite Loading screen on initial app open (AuthGate/Profile bootstrap)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Update the authentication gate so the app never blocks on profile/actor queries before the user has authenticated, and so an unauthenticated visitor always sees the Sign In screen instead of an infinite \"Loading...\" screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "kok loading terus? tidak kebuka program nya",
          "“ya, perbaiki”."
        ]
      },
      "acceptanceCriteria": [
        "With no existing Internet Identity session, opening the app shows the Sign In screen (not a loading spinner) within 2 seconds.",
        "While Internet Identity is initializing, a loading indicator may appear, but it must resolve to either Sign In (if not authenticated) or the app (if authenticated) without getting stuck.",
        "The profile query is not awaited/required to render Sign In when identity is missing."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Fix the caller profile data flow to use the real backend profile API (not placeholder role-based data), and ensure onboarding redirects only happen after the profile fetch has definitively completed.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Aplikasi stuck loading (layar hitam “Loading…”) saat membuka link awal setelah rilis Version 4; diduga terkait flow AuthGate/AppLayout + profile/role check yang menunggu data tidak pernah ter-resolve."
        ]
      },
      "acceptanceCriteria": [
        "When authenticated and the backend returns no profile / not onboarded, the user is redirected to /onboarding exactly once and the page renders (no redirect loop).",
        "When authenticated and the backend returns an onboarded profile, the user is not redirected to /onboarding and can access the dashboard.",
        "The Profile page and header logic rely on the fetched profile (including onboarded flag) rather than a hard-coded placeholder profile.",
        "If the generated frontend actor typings do not currently expose getCallerUserProfile (or equivalent), the backend must expose a public method that returns the caller profile used by the UI, without changing the existing stored profile schema."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Add resilient error handling for profile/role checks so transient backend errors do not cause an infinite loading state; show a recoverable UI state (e.g., Sign In if not authenticated, or an error message with a retry action if authenticated).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "kok loading terus? tidak kebuka program nya"
        ]
      },
      "acceptanceCriteria": [
        "If profile fetch fails while authenticated, the UI displays an error state with a visible retry action instead of remaining on an indefinite spinner.",
        "Retrying after a failure successfully re-attempts the profile fetch and proceeds to the correct route (dashboard or onboarding) when the backend responds.",
        "Console errors may exist for debugging, but the UI must not remain blocked indefinitely."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Ensure the main layout (AppLayout) does not hide all navigation/content in a way that appears like a broken app during onboarding and immediately after login; the header may be hidden on onboarding, but the page content must always render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "di awal membuka link nya. ini screnshot nya saya kirim"
        ]
      },
      "acceptanceCriteria": [
        "After login, the onboarding page content renders even if the header is intentionally hidden.",
        "After login and successful profile load, dashboard content renders and navigation becomes available for onboarded users.",
        "There is no full-screen blank/black page caused by layout gating conditions."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the immutable hook paths listed in SYSTEM_CONTEXT must not be edited directly; compose around them if changes are needed.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if a stable-state upgrade is required (avoid if not necessary)."
  ],
  "nonGoals": [
    "Adding new product features beyond fixing the loading/auth/profile/onboarding/admin-check flow.",
    "Changing the data model/schema for user profiles, vehicles, transfers, lost/found reports, or invite tokens (unless strictly required to fix the loading issue).",
    "Introducing external services, databases, or new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}