{
  "kind": "build_request",
  "title": "Expose ownership revocation from main menu and improve discoverability of Vehicle Detail page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a main-menu entry point for the existing ownership revocation flow so users can access it from the primary navigation (menu utama), not only from the Vehicle Detail page. This must be user-visible in the top navigation (AppHeader) and must use English labeling (e.g., \"Revoke Ownership\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-2026-02-12-1"
        ],
        "quotes": [
          "bagusnya sih di tampilkan di menu utama saja ya."
        ]
      },
      "acceptanceCriteria": [
        "A new navigation item is visible in the main app navigation (header menu) labeled in English (e.g., \"Revoke Ownership\").",
        "Clicking the new navigation item takes the user to a screen that allows them to proceed toward revoking ownership (it may reuse existing pages/flows), without requiring the user to first find VehicleDetailPage manually.",
        "No protected/immutable auth hooks are modified."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a Dashboard (home) \"Quick Action\" entry point for ownership revocation, placed alongside existing Dashboard quick actions, with English user-facing text. The action must guide the user into a revoke flow by first selecting a vehicle (if needed) and then continuing to the existing PIN-verified revocation process.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-2026-02-12-1"
        ],
        "quotes": [
          "di tampilkan di menu utama saja ya"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard shows an additional quick action card/button labeled in English (e.g., \"Revoke Ownership\").",
        "From that quick action, a user can reach a vehicle-selection step (if applicable) and then proceed to the existing PIN prompt + revocation mutation.",
        "The existing revocation behavior remains PIN-gated and continues to invalidate the same React Query caches as before."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve discoverability of the existing Vehicle Detail page so users can clearly find and open it from the vehicle list and immediately after registering a vehicle. Do not change the existing route path (`/vehicles/$vehicleId`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-2026-02-12-1"
        ],
        "quotes": [
          "Dan saya juga tidak melihat fitur Halaman Detail Kendaraan (Vehicle Detail Page)."
        ]
      },
      "acceptanceCriteria": [
        "Vehicles list makes it explicit how to open vehicle details (e.g., an explicit \"View Details\" button/affordance on each vehicle card, in English).",
        "After successful vehicle registration, the UI offers a clear path to the newly registered vehicle’s detail screen (e.g., redirect to the detail page, or success toast with a \"View Details\" action), without removing the existing ability to go back to /vehicles.",
        "Vehicle detail route remains `/vehicles/$vehicleId` and continues to render the existing revoke-ownership button under the existing owner gating (owner + ACTIVE)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; do not introduce additional canisters/services.",
    "Do not edit files under frontend immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Do not change existing route paths in `frontend/src/App.tsx` for `/vehicles/$vehicleId` (Vehicle Detail). If any new route is added, it must be documented per `frontend/CHANGE_CONTROL_POLICY.md`.",
    "All new/updated user-facing text must be in English."
  ],
  "nonGoals": [
    "Implementing a new backend revocation API or changing the backend revocation rules (PIN validation, authorization, status gating).",
    "Adding third-party auth or any non-Internet-Identity login options.",
    "Redesigning the vehicle registration form fields or validation beyond what’s necessary to add a clearer post-registration navigation path."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}