{
  "kind": "build_request",
  "title": "Re-add PIN management to Profile page without affecting existing users",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expose a backend API to let the frontend determine whether the caller has a PIN set, without returning the PIN value, so existing users can set/update a PIN via their existing account profile without re-registering.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Harusnya di tambahkan PIN... Fokus ke akun profil saja menambahkan PIN saja."
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a query method (e.g., returns Bool) indicating whether the caller currently has a PIN set.",
        "The query traps for anonymous callers consistently with other profile/PIN methods.",
        "No existing backend methods used by current flows (profile save, onboarding, vehicle registration, transfers) change behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Re-add PIN section to the existing Profile page UI so users can create a PIN (if none exists) or update their PIN (if already set) directly from the Profile page, without requiring re-onboarding or re-registration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Kan tadi nya di akun profile ada buat PIN. sekarang hilang. Di muncul kan lagi saja... Tinggal tambahkan field PIN saja."
        ]
      },
      "acceptanceCriteria": [
        "Profile page shows a clearly labeled PIN section in English (e.g., 'PIN' / 'Security PIN').",
        "If the user has no PIN, the Profile page shows a 'Create PIN' form that calls the existing setupPIN mutation.",
        "If the user already has a PIN, the Profile page shows an 'Update PIN' form requiring old PIN + new PIN + confirm, calling the existing updatePIN mutation.",
        "Client-side validation prevents submission when new PIN and confirmation do not match and enforces a minimum length of 4 characters (matching existing SecuritySettingsPage behavior).",
        "Successful create/update invalidates or refreshes any relevant PIN-status query so the UI updates immediately.",
        "No changes are made to unrelated Profile page functionality (profile editing, activation card, logout, principal display)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure existing users’ stored profile data remains intact when introducing the Profile-page PIN UI and PIN-status query, and avoid any requirement for users to register again.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pengguna yang sudah daftar jangan sampe hilang data nya, cukup nanti di update saja akun profile nya untuk membuat PIN. karena kalau daftar lagi takut nya jadi error."
        ]
      },
      "acceptanceCriteria": [
        "Existing userProfile fields (fullName, email, city, country, onboarded) are unchanged and continue to load/save as before.",
        "PIN changes do not modify or overwrite stored profile data in saveCallerUserProfile.",
        "No new onboarding or registration steps are introduced to set a PIN."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep all Motoko logic within the single backend actor (backend/main.mo).",
    "Do not disrupt existing, already-working features; scope changes to Profile/PIN only."
  ],
  "nonGoals": [
    "Do not change vehicle transfer flow or PIN prompt behavior in transfer dialogs.",
    "Do not add third-party authentication or any external database.",
    "Do not redesign unrelated pages or convert existing Indonesian UI text outside the Profile page."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}