{
  "kind": "build_request",
  "title": "Fix admin account incorrectly showing Vehicle Registration status as Not Activated",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend activation-status check so the allowlist admin principal is always considered activated for vehicle registration, ensuring the admin account never shows a 'Not Activated' status in the UI.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ini kenapa saya sebagai admin tapi status akun nya Not Active ? Kan saya ini admin nya. Coba perbaiki dan jangan ganggu fitur-fitur yang sudah berjalan normal. Fokus ke akun admin saja."
        ]
      },
      "acceptanceCriteria": [
        "When the caller principal equals the hard-coded allowlist admin (backend/main.mo:79), backend method isCallerActivatedForVehicleRegistration returns true regardless of userActivations state.",
        "For non-admin/non-allowlist users, isCallerActivatedForVehicleRegistration behavior remains unchanged (returns the value from userActivations or false if missing).",
        "No changes are made to activation token issuance/redeem flows for normal users."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Profile and Vehicles pages reflect the corrected admin activation status without introducing new UI flows or altering existing working features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "jangan ganggu fitur-fitur yang sudah berjalan normal. Fokus ke akun admin saja."
        ]
      },
      "acceptanceCriteria": [
        "When logged in as the allowlist admin principal, the Profile page activation card shows 'Activated' (not 'Not Activated') and does not show the activation-token redeem form.",
        "When logged in as the allowlist admin principal, Vehicles page treats the account as activated (shows the 'Register Vehicle' primary action rather than 'Activate to Register').",
        "For non-admin users, activation UI/behavior remains unchanged (still shows 'Not Activated' when userActivations is false/missing)."
      ]
    }
  ],
  "constraints": [
    "Do not change or remove existing backend authorization rules (admin/user permission helpers) except what is necessary to correct the allowlist admin activation status.",
    "Do not modify any files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep all other existing features working as-is; scope is limited to the admin account activation status display and its underlying activation check."
  ],
  "nonGoals": [
    "Do not redesign the activation feature for all admins or all users.",
    "Do not introduce new roles, new admin management screens, or new activation-token policies.",
    "Do not perform data migrations unless strictly required for this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}