{
  "kind": "build_request",
  "title": "Fix admin access visibility and enable editable Profile form",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Ensure the allowlisted Principal ID `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae` is treated as an admin immediately after sign-in, so the Admin navigation entry appears and admin routes are accessible for this Principal.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "langsung lakukan perbaikan admin-access + perbaikan form Profile di build"
        ]
      },
      "acceptanceCriteria": [
        "When signed in as Principal `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`, the top navigation (desktop) and mobile navigation show an 'Admin' item.",
        "When signed in as that Principal, visiting `/admin` renders the Admin Dashboard page (not Access Denied).",
        "All backend admin-gated endpoints used by the Admin UI succeed for that Principal without requiring a separate 'claim first admin' step."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Fix the frontend admin-status data flow so `useIsCallerAdmin()` accurately reflects backend admin status (including the allowlist admin) and updates the UI reliably after authentication and after any admin-claim action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "langsung lakukan perbaikan admin-access + perbaikan form Profile di build"
        ]
      },
      "acceptanceCriteria": [
        "After login completes, the Admin menu item appears/disappears correctly based on the backend admin check without requiring a hard refresh.",
        "If the user successfully claims admin via the existing claim flow, the Admin menu item appears within the same session (no reload).",
        "Admin status query failures do not silently downgrade a real admin to non-admin; show a recoverable UI state (e.g., retry) where appropriate on admin pages."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Replace the placeholder Profile hook implementation so the app fetches the real stored profile from the backend and can persist profile edits (full name, optional email, city, country).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "langsung lakukan perbaikan admin-access + perbaikan form Profile di build"
        ]
      },
      "acceptanceCriteria": [
        "`useGetCallerUserProfile()` returns the actual saved values (fullName/email/city/country/onboarded) instead of role-based placeholders.",
        "`useSaveCallerUserProfile()` performs a real backend call to persist edits and invalidates/refetches the `currentUserProfile` query on success.",
        "If the backend interface used by the frontend is missing the profile methods, it is updated so the generated actor exposes the required profile APIs used by the hooks."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Update the Profile page to provide an editable form for full name, email, city, and country, with clear English user-facing text and Save/Cancel actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "langsung lakukan perbaikan admin-access + perbaikan form Profile di build"
        ]
      },
      "acceptanceCriteria": [
        "Profile page shows an obvious 'Edit profile' action when viewing the profile.",
        "In edit mode, the user can type into inputs for Full Name (required), Email (optional), City, and Country, then Save or Cancel.",
        "Saving shows a success confirmation, exits edit mode, and the displayed values match what is fetched from the backend after save.",
        "Cancel discards unsaved changes and returns to view mode.",
        "The Principal ID remains visible as read-only text on the Profile page.",
        "The existing Logout action continues to log out and clears cached app state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or other immutablePaths; compose existing UI components instead.",
    "Use English for all user-facing text introduced or modified by this change."
  ],
  "nonGoals": [
    "Do not redesign the overall navigation structure beyond what is required to make Admin and Profile functionality work.",
    "Do not add new authentication providers (Internet Identity remains the only auth method).",
    "Do not add new profile fields beyond full name, email, city, and country."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}