{
  "kind": "build_request",
  "title": "Build Pasar Digital Community (vehicle anti-theft registry) with invite-only onboarding, ownership transfer PIN, lost/found reporting, admin dashboard, and logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement Internet Identity (Principal-based) authentication and gate all app features behind sign-in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "menggunakan Principle ID ketika mendaftarkan kendaaran"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users are redirected to a sign-in screen",
        "After signing in with Internet Identity, the UI shows the signed-in Principal and unlocks the app navigation"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add invite-only onboarding: users can only complete initial profile setup after providing a valid, unused invitation token generated by an admin.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "mendapatkan Token Undangan (Generate Token) yang di buat oleh Admin, ... link ini hanya sekali pakai",
          "di akun admin ada laporan link sudah di gunakan"
        ]
      },
      "acceptanceCriteria": [
        "Backend can create invitation tokens (single-use) and mark them as used on successful onboarding",
        "Frontend provides an \"Accept Invitation\" flow where a user inputs/pastes an invite token and can proceed only if it is valid and unused",
        "Admin can view a list of issued tokens and their status (unused/used), including timestamps for creation and use"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create a user profile model linked to Principal that stores: full name, email, city, country; allow users to view/update their profile after onboarding.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "setelah itu pengguna di minta memasukan nama, email, dan lokasi (Kota), Negara"
        ]
      },
      "acceptanceCriteria": [
        "On first onboarding (via invite), the user must submit name, email, city, and country",
        "After onboarding, the user can open a Profile page and update these fields",
        "Backend enforces that profile data is readable/writable only by the owning Principal (except admin reporting if required by REQ-9)"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement vehicle registration tied to the owner Principal, storing: engine number, chassis number, brand, type/model, year, vehicle location, and vehicle photo.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "memasukan nomor mesin, nomor rangka, merek Mobil, Type Mobil, Tahun, Lokasi Mobil nya, Foto mobilnya"
        ]
      },
      "acceptanceCriteria": [
        "Frontend provides a \"Register Vehicle\" form with the required fields and image upload",
        "Backend stores vehicle records and associates them with the registering Principal as owner",
        "Users can list and view details of vehicles they own",
        "Vehicle photo is stored/referenced in a way that is retrievable for display in the UI (within Internet Computer constraints)"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a per-user (or per-vehicle) PIN setup and verification flow; require correct PIN entry to initiate ownership release/transfer actions.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ketika hendak di jual, di berikan wajib adanya pelepasan kepemilikan kendaraan ... mewajibkan pengguna memasukan PIN"
        ]
      },
      "acceptanceCriteria": [
        "User can set a PIN (with confirmation) during onboarding or in security settings before any transfer is allowed",
        "Ownership release/transfer cannot proceed unless the correct PIN is provided",
        "PIN is never displayed back to the user and is not stored in plaintext (store only a verification representation)"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement ownership release/transfer workflow: the current owner initiates a transfer (after PIN verification), producing a transfer code/link that the new owner can accept to become the new owner.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "wajib adanya pelepasan kepemilikan kendaraan"
        ]
      },
      "acceptanceCriteria": [
        "Current owner can initiate a transfer for a specific vehicle after PIN verification",
        "A transfer can be accepted only once, and only by an authenticated Principal",
        "After acceptance, the vehicle’s owner Principal updates to the new owner and the previous owner no longer sees it in their owned list (but may see history if included)",
        "Backend prevents non-owners from initiating transfers"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement lost-vehicle reporting: an owner can mark one of their vehicles as stolen/lost with a report note; all authenticated users can browse/search the lost list to deter resale of stolen vehicles.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pengguna ... kehilangan kendaraan, maka pengguna bisa melaporkan di sistem nomor mesin sekian hilang di curi, dan semua pengguna bisa mengetahui"
        ]
      },
      "acceptanceCriteria": [
        "Owner can create a lost report for a vehicle they own (or mark the vehicle status as Lost)",
        "All authenticated users can view a Lost Vehicles page listing reported vehicles with key identifiers (at minimum engine number) and report timestamp",
        "Lost Vehicles page supports searching/filtering by engine number and/or chassis number"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Implement found-vehicle reporting and in-app notifications: any authenticated user can report a lost vehicle as found; the vehicle owner receives an in-app notification and can view the found details.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ada juga laporan jika kendaraan di temukan yang mana nanti notifikasi nya masuk ke pengguna"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated user can submit a \"Found\" report referencing a lost vehicle (e.g., by selecting from lost list or entering engine number)",
        "Vehicle owner can view an in-app Notifications list showing found reports for their vehicles",
        "Notifications are persisted and remain visible until the user marks them as read"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add an admin role and admin dashboard with system stats and reports: total vehicles registered, total lost reports, and invitation token issuance/usage report.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "di dalam program nanti tertera berapa mobil yang sudah terdaftar",
          "di akun admin ada laporan link sudah di gunakan"
        ]
      },
      "acceptanceCriteria": [
        "Backend has an admin allowlist of Principal(s) (configurable) and enforces admin-only methods",
        "Admin dashboard shows: total registered vehicles, total lost vehicles/reports, and invitation token status list",
        "Non-admin users cannot access admin dashboard routes or admin backend methods"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Integrate the provided app logo into the UI: add it as a static asset and use it in the app header and on the sign-in/onboarding screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Nama Aplikasi nya, Pasar Digital Community dan ini saya kasih logonya juga. Anda masukan dalam aplikasi"
        ]
      },
      "acceptanceCriteria": [
        "The uploaded logo file is included in the frontend static assets and rendered crisply without distortion",
        "Header displays the logo alongside the app name \"Pasar Digital Community\"",
        "Sign-in/onboarding screens display the logo prominently"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Choose and apply a coherent visual theme (colors, typography, spacing, layout) appropriate for a security/registry app and use it consistently across all pages (avoid blue/purple palettes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ya sudah sekarang anda build aplikasi nya. Nama Aplikasi nya, Pasar Digital Community"
        ]
      },
      "acceptanceCriteria": [
        "All core pages (Sign-in, Onboarding/Invite, Dashboard, Vehicles, Lost Vehicles, Notifications, Admin) share a consistent theme",
        "Theme uses a non-blue/non-purple primary palette and remains accessible (sufficient contrast for text/buttons)"
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); add migration.mo only if upgrading existing stable state",
    "Frontend must not modify immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "No external databases or server infrastructure; persist data in canister stable storage",
    "Authentication must use Internet Identity (no third-party auth providers)",
    "Notifications must be implemented as in-app/polling or query-based (no WebSockets/push/email/SMS)"
  ],
  "nonGoals": [
    "Implementing payment processing or subscription billing (paid users are handled via invite tokens only)",
    "Integrating with government e-BPKB systems or external vehicle registries",
    "Real-time chat or real push notifications",
    "Public, unauthenticated browsing of stolen vehicle data (lost list is for authenticated users unless explicitly requested later)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}