{
  "kind": "build_request",
  "title": "Fix allowlisted admin detection so Admin menu and dashboard are accessible after login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-62",
      "text": "Ensure the allowlisted Principal ID `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae` is treated as an admin immediately after Internet Identity login (without requiring onboarding), so the Admin navigation entry appears and the /admin route is accessible.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "perbaiki aplikasi agar Principal ID saya langsung dikenali sebagai admin setelah login dan fitur dashboard admin yang bisa di klik"
        ]
      },
      "acceptanceCriteria": [
        "After signing in with Internet Identity using Principal `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`, the top navigation includes an \"Admin\" item.",
        "Clicking \"Admin\" navigates to `/admin` and renders the Admin Dashboard page (not AccessDeniedScreen).",
        "The allowlisted Principal is not forced into `/onboarding` even when `getCallerUserProfile()` returns null/None.",
        "Backend admin-gated endpoints (e.g., `getSystemStats`, `getInviteCodes`, `generateInviteCode`) authorize this allowlisted Principal successfully immediately after login."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Fix admin-status data flow so the UI does not incorrectly show the allowlisted admin as a normal user (e.g., \"User\" without Admin menu) due to stale React Query cache, query timing, or transient actor bootstrap states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "saya sudah logout terus masuk lagi melalui internet identity, tapi tetap dashboard admin tidak ada. malah saya masih di anggap user."
        ]
      },
      "acceptanceCriteria": [
        "Logging out and logging back in with the allowlisted Principal consistently shows the Admin navigation entry without requiring a hard refresh.",
        "Admin link visibility updates reliably when identity changes (no stale admin status from a previous principal).",
        "If the admin-status check fails transiently, the UI provides a recoverable state (retry) and does not permanently hide the Admin entry for the allowlisted Principal."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Ensure invite-token management is reachable and functional for the allowlisted admin: the Admin Dashboard must provide a working navigation path to `/admin/invite-tokens`, and generating invite tokens must work end-to-end.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Sekarang mana dashboard nya admin? gimana admin mau buat token undangan?"
        ]
      },
      "acceptanceCriteria": [
        "From `/admin`, the \"Manage Invite Tokens\" action navigates to `/admin/invite-tokens`.",
        "On `/admin/invite-tokens`, clicking \"Generate\" (or equivalent) creates a new invite token and it appears in the Unused list without a manual refresh.",
        "Copy invite link (or equivalent copy action) works for an unused token and includes the token value in the copied URL."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add `backend/migration.mo` if state migration is required.",
    "Do not modify any files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` (compose instead)."
  ],
  "nonGoals": [
    "Adding new admin features beyond fixing admin recognition and making the existing Admin Dashboard/Invite Tokens pages accessible.",
    "Changing the onboarding/invite-token business rules for non-admin users.",
    "Introducing third-party auth providers or non-Internet-Identity login methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}