{
  "kind": "build_request",
  "title": "Introduce change-control guardrails to prevent unintended code changes during feature additions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a repository-level change-control policy that defines: (1) which files/areas are considered stable contracts (e.g., backend public methods/Candid surface, auth bootstrap flow, routing), (2) the required review checklist for any feature change (expected behavior changes, affected routes, affected backend methods, state schema impact), and (3) the required verification steps before merging (typecheck, lint, tests).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "COBA ANDA KUNCI CODING NYA BIAR TIDAK BERUBAH-UBAH KETIKA PENAMBAHAN FITUR. KARENA SAYA CAPEK RIBUT DENGAN ANDA"
        ]
      },
      "acceptanceCriteria": [
        "A written policy exists in-repo (markdown) describing change-control rules and a mandatory checklist.",
        "The policy explicitly calls out the backend public API (actor methods) and frontend route structure as protected/stable interfaces.",
        "The policy is referenced by a PR template or equivalent contributor checklist file so it is hard to miss."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Introduce automated “gates” that run locally and in CI to prevent silent regressions: TypeScript typecheck, linting, formatting check, and a minimal test suite runner for the frontend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "KUNCI CODING NYA BIAR TIDAK BERUBAH-UBAH KETIKA PENAMBAHAN FITUR"
        ]
      },
      "acceptanceCriteria": [
        "There is a single command (e.g., a script) that runs all frontend quality gates in one go (typecheck + lint + format check + tests).",
        "The gates fail the build when there are TypeScript errors, lint errors, or formatting drift.",
        "Documentation explains how to run the gates locally before shipping changes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a backend API “contract check” that detects unintended changes to the canister’s public interface (Candid surface) and fails CI when the interface changes without an explicit acknowledgement/update step.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "BIAR TIDAK BERUBAH-UBAH KETIKA PENAMBAHAN FITUR"
        ]
      },
      "acceptanceCriteria": [
        "A reproducible command exists to generate/verify the backend interface signature (e.g., compare a committed interface artifact or hash).",
        "CI fails when the backend interface changes and the committed contract artifact is not updated.",
        "Documentation states the exact steps to intentionally update the contract artifact when a deliberate API change is made."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add smoke/regression tests for the most failure-prone user flows already present in the app (authentication gate + actor bootstrap; dashboard route rendering; one representative data-fetch flow) to reduce regressions when new features are added.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "At least one automated test covers the RootRouteGate bootstrap behavior at a high level (no blank screen / renders expected state for loading vs error).",
        "At least one automated test ensures the router mounts and core routes render without crashing (e.g., Dashboard + Vehicles).",
        "Tests can run headlessly in CI and are included in the quality-gates command from REQ-2."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a lightweight release/versioning discipline inside the repo so changes are easier to track and disputes about “what changed” are minimized (e.g., changelog entries per version and a visible app version string).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "KARENA SAYA CAPEK RIBUT DENGAN ANDA"
        ]
      },
      "acceptanceCriteria": [
        "A CHANGELOG file exists and is updated as part of feature work.",
        "The frontend shows a version identifier somewhere appropriate (e.g., About page/footer) sourced from a single canonical location.",
        "The backend exposes a simple version/build identifier via an existing or new query method, or the project documents why frontend-only versioning is used."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not modify any frontend files listed as immutable in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add migration code if a stable-state schema change requires it.",
    "All user-facing text introduced by these changes must be in English."
  ],
  "nonGoals": [
    "Implementing third-party CI providers beyond standard repository configuration (no external SaaS dependencies required to run tests locally).",
    "Adding new product features unrelated to change-control (e.g., new pages, new vehicle functionality).",
    "Re-architecting the backend into multiple canisters/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}