{
  "kind": "build_request",
  "title": "Fix My Vehicles visibility and ownership revocation errors, then ship a new build",
  "projectName": "Pasar Digital",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the “My Vehicles” list so that vehicles registered by the currently signed-in Internet Identity principal reliably appear in the “My Vehicles” page (and related pages that reuse the same query), without requiring a manual refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ini kok masih belum ada kendaraan saya yang  sudah di daftar di fitur kendaraan saya? tapi di Check Vehicle Status ada  kendaraan saya"
        ]
      },
      "acceptanceCriteria": [
        "After registering a vehicle and returning to “My Vehicles”, the newly registered vehicle is visible for the same signed-in principal.",
        "“My Vehicles” does not show an empty list when the backend has vehicles whose `owner` matches the current caller principal.",
        "Switching accounts (login/logout) shows the correct vehicle list for the active principal (no cross-account leakage from stale cache)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure React Query cache invalidation/refetch behavior is correct for the vehicle workflows so UI state updates immediately after successful vehicle registration and after successful ownership revocation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "paksa React Query invalidasi cache setelah pendaftaran kendaraan"
        ]
      },
      "acceptanceCriteria": [
        "After a successful `registerVehicle` mutation, the `getUserVehicles` query is invalidated/refetched such that “My Vehicles” reflects the new state without a hard reload.",
        "After a successful `revokeVehicleOwnership` mutation, the revoked vehicle no longer appears in “My Vehicles”, “Vehicle Detail”, and “Revoke Ownership” listings for the same principal.",
        "No unnecessary infinite refetch loops are introduced (queries settle after updates)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the ownership revocation (“lepas” / revoke) flow so that it no longer fails due to mismatched identifiers or misleading generic errors; display clear English error messages when revocation fails.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Error saat melepaskan kepemilikan",
          "fix error ketika melepaskan kepemilikan"
        ]
      },
      "acceptanceCriteria": [
        "A user can revoke ownership of an ACTIVE vehicle they own by entering the correct PIN, and the operation succeeds end-to-end.",
        "If revocation fails (e.g., incorrect PIN, unauthorized, vehicle not found), the UI surfaces a clear English error message (not a generic “something went wrong”).",
        "The frontend uses the correct `vehicleId` when calling `revokeVehicleOwnership` and does not attempt to revoke ownership for vehicles not owned by the current principal.",
        "Backend behavior remains consistent with removing the vehicle record on successful revocation (so it can be registered again)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Produce and publish a new build after implementing the requested fixes, ensuring the app passes existing quality gates and does not modify unrelated working features.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Anda kerjakan saja sampai build."
        ]
      },
      "acceptanceCriteria": [
        "A new build is generated with the fixes included.",
        "Frontend quality gates (typecheck/lint/format as defined by the project) pass.",
        "Manual verification confirms: register vehicle → appears in “My Vehicles”; revoke ownership → no errors and vehicle removed; “Check Vehicle Status” still works as before."
      ]
    }
  ],
  "constraints": [
    "Do not change or remove existing routes/paths defined in frontend/src/App.tsx (protected interface).",
    "Do not edit files under frontend immutable paths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui); compose around them instead.",
    "Keep backend architecture as a single Motoko actor in backend/main.mo; only introduce migration.mo if a state schema upgrade is truly required.",
    "User-facing text introduced/modified as part of these fixes must be in English.",
    "Limit changes to the vehicle listing and revoke-ownership workflows; avoid regressions in other features already working normally."
  ],
  "nonGoals": [
    "Removing or disabling StartupBootstrapError/ProfileBootstrapError screens.",
    "Fixing the reported React DOM crash in the lost/stolen/pawned reporting flow (removeChild error).",
    "Adding new features, new routes, or changing backend public API signatures beyond what is required to fix the listed issues."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}