{
  "kind": "build_request",
  "title": "Fix missing user vehicle listing and revoke ownership errors",
  "projectName": "Pasar Digital",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend revoke/detach ownership flow so that when a user revokes ownership (\"lepas\" / \"hapus\" vehicle), the vehicle is consistently removed or detached in a way that allows the same engine+chassis to be registered again, and the operation no longer returns a generic error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tadinya saya coba hapus 1 unit motor dan terhapus, dan saya daftarkan ulang motor tersebut tapi tidak mau ke fitur kendaraan saya... Dan jika mau di lepas juga masih ada error. Muncul pesan ada kesalahan."
        ]
      },
      "acceptanceCriteria": [
        "Calling revokeVehicleOwnership no longer returns a generic error for a valid owner+PIN flow.",
        "After a successful revoke, subsequent registerVehicle with the same engineNumber and chassisNumber succeeds (i.e., the previous record does not block re-registration).",
        "After a successful revoke, checkVehicle for the engine number reflects the intended post-revoke behavior (either not found if deleted, or clearly not owned/active if retained), and this behavior is consistent with what the frontend shows.",
        "The change does not require a state migration unless the persisted types change."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the user vehicle listing inconsistency so that a vehicle that exists in the system (visible in admin totals and via Vehicle Check) reliably appears in the owning user’s “My Vehicles” list when the backend record owner matches the currently signed-in principal.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "saya sudah daftarkan 1 unit motor tapi di fitur kendaraan saya tidak muncul sedang kan di akun admin ada 1 unit motor terdaftar... tapi jika di cek di fitur Periksa Status Kendaraan ada."
        ]
      },
      "acceptanceCriteria": [
        "If a vehicle’s owner principal equals the current signed-in principal, getUserVehicles returns it and the Vehicles page renders it.",
        "Vehicles list data is scoped to the signed-in principal (no cross-account React Query cache bleed); switching accounts cannot show another account’s cached vehicle list.",
        "After registering a vehicle successfully, navigating to “My Vehicles” shows the vehicle without requiring a hard refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add safe, minimal frontend error handling for “My Vehicles” and “Revoke Ownership” flows so that backend/query errors are displayed clearly (in English) instead of silently showing empty lists or a generic “something went wrong”, without changing unrelated features or routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Coba anda perbaiki dan fokus ke apa yang saya minta saja. Jangan mengganggu fitur-fitur yang sudah berjalan NORMAL."
        ]
      },
      "acceptanceCriteria": [
        "VehiclesPage shows a clear error state when getUserVehicles fails (instead of rendering as empty/undefined data).",
        "RevokeOwnershipPage shows a clear error state when getUserVehicles fails and shows the backend error message (normalized) when revoke fails.",
        "All new/updated user-facing strings for these new error states are in English.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Keep changes tightly scoped to vehicle listing, vehicle re-registration after revoke/delete, and revoke/detach ownership errors.",
    "Do not modify or regress features that are currently working normally.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose instead).",
    "Backend must remain a single Motoko actor (backend/main.mo)."
  ],
  "nonGoals": [
    "Do not implement new authentication methods beyond Internet Identity.",
    "Do not redesign the UI or navigation structure beyond minimal error-state rendering required for these fixes.",
    "Do not add new backend services, databases, or external integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}