{
  "kind": "build_request",
  "title": "Enable installable PWA (Android/iOS) and set favicon to Pasar Digital logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the frontend fully installable as a Progressive Web App (PWA) on Android and iOS by ensuring the service worker is registered in the app and that the manifest + app icons are correctly served from the frontend static assets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Aplikasi ini belum anda jadikan web aplikasi (PWA) supaya bisa di buka di hp android dan IOS dan langsung bisa di install."
        ]
      },
      "acceptanceCriteria": [
        "On first load in a production build, the app registers the existing service worker at `/sw.js` without console errors.",
        "In Chrome/Edge, the site meets installability checks (valid manifest, service worker controlling the page) and shows an install prompt (where supported).",
        "In iOS Safari, the app can be added via “Add to Home Screen” and launches in standalone mode using the manifest metadata/icons.",
        "No existing application routes, auth flow, or backend interactions are broken by the PWA changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update PWA metadata so that the favicon and platform icons use the Pasar Digital logo consistently, including browser favicon(s), Apple touch icon, and manifest icons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Jangan lupa pavicon gunakan logo Pasar Digital."
        ]
      },
      "acceptanceCriteria": [
        "Browser tabs show the Pasar Digital logo as the favicon (at least 16x16 and 32x32 sizes).",
        "`frontend/index.html` references the generated favicon(s) and Apple touch icon from `/assets/generated/` and no longer relies on non-logo placeholders.",
        "`frontend/public/manifest.webmanifest` icons point to generated logo-based icons and remain valid JSON.",
        "Generated icons are stored as static assets under `frontend/public/assets/generated/` and are referenced directly by the frontend (not routed through the backend)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a minimal verification checklist (documented in CHANGELOG.md) for PWA installability covering Android Chrome and iOS Safari, without changing existing feature behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ]
      },
      "acceptanceCriteria": [
        "CHANGELOG.md includes an entry documenting PWA enablement and the manual install verification steps for Android and iOS.",
        "No protected route paths are changed as part of this update."
      ]
    }
  ],
  "constraints": [
    "Do not change or break any existing working features; limit changes strictly to PWA installability and favicon/icon branding.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (immutable paths).",
    "Keep the backend as-is; no Motoko API changes are required for PWA support."
  ],
  "nonGoals": [
    "Adding push notifications or background sync.",
    "Adding third-party analytics or external services.",
    "Changing authentication providers (must remain Internet Identity)."
  ],
  "imageRequirements": {
    "required": [
      "Browser favicon using the Pasar Digital logo (favicon.dim_32x32.png)",
      "Browser favicon using the Pasar Digital logo (favicon.dim_16x16.png)",
      "Apple touch icon using the Pasar Digital logo (apple-touch-icon.dim_180x180.png)",
      "PWA app icon using the Pasar Digital logo (pwa-icon.dim_192x192.png)",
      "PWA app icon using the Pasar Digital logo (pwa-icon.dim_512x512.png)",
      "Maskable PWA icon using the Pasar Digital logo (pwa-maskable.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text in build artifacts and documentation."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}