{
  "kind": "build_request",
  "title": "Fix user onboarding so registration does not require admin authorization",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend onboarding so a normal user completing onboarding with a valid invite token can be assigned the `#user` role without requiring admin privileges, and without trapping with the error `Unauthorized: Only admins can assign user roles`. Keep the existing behavior for the allowlisted first-admin claim (allowlisted principal can complete onboarding with an empty token).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ini sekarang di akun pengguna, masih tetap minta authorize ke admin. Kan saya sudah bilang di permudah untuk daftar nya, Coba lihat screnshot yang saya kirim"
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin, non-allowlisted user calls `completeOnboarding(inviteToken, profile)` with a valid, unused invite token, the call succeeds and the user can subsequently access user-gated methods (e.g., `getCallerUserProfile` returns a non-null profile, `registerVehicle` is allowed).",
        "The onboarding flow does not produce/trap with `Unauthorized: Only admins can assign user roles` for normal users.",
        "The allowlisted admin principal (\"dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae\") can still call `completeOnboarding('', profile)` (when not yet onboarded) successfully."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend onboarding error handling so that if the backend still returns an authorization-related onboarding failure, the onboarding UI shows a clear English message explaining registration could not be completed (without mentioning admin role assignment), and does not display the raw backend error string to end users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "masih tetap minta authorize ke admin"
        ]
      },
      "acceptanceCriteria": [
        "On `/onboarding`, users do not see the raw error text `Unauthorized: Only admins can assign user roles` in the inline alert or toast.",
        "The user-facing error message is in English and is actionable (e.g., suggests trying again or contacting an admin), while preserving existing error mappings for invalid/used tokens and already-onboarded users."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep all Motoko logic in `backend/main.mo`.",
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts` / `.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (immutable paths).",
    "Do not change the public backend API method names/signatures used by the frontend (e.g., `completeOnboarding`, `getCallerUserProfile`)."
  ],
  "nonGoals": [
    "Removing the invite-token requirement for non-admin users (registration should still follow the existing invite-token rules unless explicitly changed later).",
    "Adding new authentication providers or third-party identity systems."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}