{
  "kind": "build_request",
  "title": "Fix missing branding logo, ensure admin invite-token tools visible, add About page, and enable PWA install",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add the uploaded Pasar Digital Community logo image to the frontend static assets and ensure it renders correctly wherever the app uses the logo (sign-in screen, onboarding, and the in-app header).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "ini logo nya.",
          "Untuk logo ketika pertama kali Porgram kebuka dan di dalam program."
        ]
      },
      "acceptanceCriteria": [
        "The uploaded file \"Logo Pasar Digital Community-1.png\" is included in the repo as a static asset (served by the frontend).",
        "The logo image is visible on the sign-in screen and in the authenticated app header (no broken/missing image placeholder).",
        "Logo renders with correct aspect ratio (no stretching) on common viewport sizes (mobile and desktop)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure the Admin features are discoverable and accessible for an admin user: the Admin entry point must appear in navigation when the signed-in principal is an admin, and the Admin Dashboard must be reachable.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-3",
          "msg-user-4"
        ],
        "quotes": [
          "Tinggal fitur admin yang belum muncul.",
          "Bagaimana Admin akan membuat Token Undangan (Generate Token)"
        ]
      },
      "acceptanceCriteria": [
        "When signed in as an admin principal, the header navigation shows an \"Admin\" entry that navigates to the Admin Dashboard route.",
        "When signed in as a non-admin principal, Admin routes show an access denied screen and the Admin entry is hidden.",
        "If the current deployment has no admin principals configured, there is a clear, documented, in-app way to bootstrap/assign the first admin without breaking existing auth gating (must not grant admin to everyone)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Make the Admin invite-token management fully functional end-to-end: admin can generate an invitation token and see a table split into unused and used tokens, with a one-click copy of an onboarding link for unused tokens.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-4",
          "msg-user-5"
        ],
        "quotes": [
          "Bagaimana Admin akan membuat Token Undangan (Generate Token)",
          "dan ada tabel daftar token (belum dipakai dan sudah di pakai) yang bisa di lihat Admin."
        ]
      },
      "acceptanceCriteria": [
        "From the Admin area, generating a new invite token succeeds and the token appears in the list without a manual refresh.",
        "The Admin invite-token page shows two sections (unused and used) reflecting real backend state.",
        "Unused tokens provide a \"copy link\" action that copies a working onboarding URL containing the inviteToken query param.",
        "Attempting to call token generation/listing from a non-admin principal fails with an authorization error handled gracefully in the UI."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add an \"About\" page that includes a brief description and the provided admin contact details: WhatsApp 089502436075 and email pasardigital.ina@gmail.com; link to it from within the app UI (footer and/or user menu).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-6"
        ],
        "quotes": [
          "Dan tambahkan juga fitur Tentang aplikasi ini berikut nomor kontak admin (WA) 089502436075 Email: pasardigital.ina@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "A new route/page exists for \"About\" and is reachable from the authenticated app UI.",
        "The About page displays the WhatsApp number \"089502436075\" and the email \"pasardigital.ina@gmail.com\" exactly as provided.",
        "The About page layout is responsive and readable on mobile and desktop."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add PWA support so the app is installable on Android and iOS (Add to Home Screen), including a web app manifest and required icons/metadata.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-7"
        ],
        "quotes": [
          "Dan aplikasi buat flesible bisa di buka di laptop dan handphone dan jadi PWA di handphone (Install) dan bisa di gunakan di anroid dan IOS."
        ]
      },
      "acceptanceCriteria": [
        "The app provides a valid web app manifest and references it from the HTML entry point.",
        "The app includes appropriate PWA icons (including at least 192x192 and 512x512) and an Apple touch icon so iOS shows a proper home screen icon.",
        "On supported browsers, the app meets installability requirements (no console errors related to manifest/icons)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Ensure core layouts (sign-in, dashboard, admin pages, token tables) are mobile-friendly and usable on small screens (no horizontal overflow, tables remain readable via responsive patterns).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-7"
        ],
        "quotes": [
          "aplikasi buat flesible bisa di buka di laptop dan handphone"
        ]
      },
      "acceptanceCriteria": [
        "All primary pages are usable at ~360px width without requiring horizontal scrolling for the main layout.",
        "Admin token tables remain readable on mobile (e.g., responsive table layout, wrapping, or horizontal scroll within the table area only).",
        "Header navigation works on mobile (menu toggle reveals nav items, including Admin when applicable)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if an upgrade requires state migration.",
    "Do not modify any files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT; compose those components instead.",
    "Do not introduce external authentication providers; Internet Identity remains the only auth mechanism."
  ],
  "nonGoals": [
    "Adding real-time features (WebSockets/chat/push notifications).",
    "Integrating third-party map/GPS/location services.",
    "Adding non-Internet-Computer databases or external backend services."
  ],
  "imageRequirements": {
    "required": [
      "PWA app icon derived from the provided logo, square, centered, with transparent padding (pwa-icon.dim_192x192.png)",
      "PWA app icon derived from the provided logo, square, centered, with transparent padding (pwa-icon.dim_512x512.png)",
      "Apple touch icon derived from the provided logo, square, centered (apple-touch-icon.dim_180x180.png)",
      "Maskable PWA icon derived from the provided logo with safe padding for masking (pwa-maskable.dim_512x512.png)"
    ],
    "edits": []
  }
}