{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Eliminate initial infinite Loading by fixing AuthGate/Profile bootstrap and onboarding redirects",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Refactor AuthGate so unauthenticated visitors see Sign In immediately and the app does not await profile/actor queries before authentication is present.",
      "acceptanceCriteria": [
        "With no existing Internet Identity session, opening the app shows the Sign In screen (not a loading spinner) within 2 seconds.",
        "While Internet Identity is initializing, a loading indicator may appear, but it must resolve to either Sign In (if not authenticated) or the app (if authenticated) without getting stuck.",
        "The profile query is not awaited/required to render Sign In when identity is missing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update AuthGate render order: only show a loader while Internet Identity is initializing; once initialization completes and identity is missing, render SignInScreen immediately (do not wait for actor/profile queries). When identity exists, allow profile bootstrap to run and gate app rendering accordingly."
        },
        {
          "path": "frontend/src/hooks/useProfile.ts",
          "operation": "modify",
          "description": "Change profile query enabling so it never runs for unauthenticated visitors: depend on Internet Identity state (identity present) before querying, preventing initial-load blocking on role/profile checks."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Use the real caller profile backend API in the profile data flow and perform onboarding redirects only after profile fetch completion (no placeholder role-based profile and no redirect loops).",
      "acceptanceCriteria": [
        "When authenticated and the backend returns no profile / not onboarded, the user is redirected to /onboarding exactly once and the page renders (no redirect loop).",
        "When authenticated and the backend returns an onboarded profile, the user is not redirected to /onboarding and can access the dashboard.",
        "The Profile page and header logic rely on the fetched profile (including onboarded flag) rather than a hard-coded placeholder profile.",
        "If the generated frontend actor typings do not currently expose getCallerUserProfile (or equivalent), the backend must expose a public method that returns the caller profile used by the UI, without changing the existing stored profile schema."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useProfile.ts",
          "operation": "modify",
          "description": "Replace placeholder role-based profile with a real profile fetch: call the backend's caller-profile function when available (e.g., getCallerUserProfile or equivalent) and use its onboarded flag. If the function is not available in current typings, surface a controlled error state (not a placeholder) so the UI can prompt retry once backend exposes it per requirement."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Move onboarding redirect logic to occur only after profile fetch is definitively completed (fetched or error). Use TanStack Router navigation (not window.location.hash mutation) and guard with a one-time redirect flag to prevent redirect loops."
        },
        {
          "path": "frontend/src/components/nav/AppHeader.tsx",
          "operation": "modify",
          "description": "Update header/account display logic to read from the fetched UserProfile (e.g., show fullName/email when available) and avoid any hard-coded placeholder profile. Use existing shadcn/ui primitives already imported; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Update Profile page to render fetched UserProfile fields (fullName/email/city/country/onboarded) and to reflect the real profile state rather than relying on static explanatory text. Use existing shadcn/ui components already used in the file; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add resilient, recoverable UI error handling for authenticated profile bootstrap failures so transient errors never result in an infinite loading screen.",
      "acceptanceCriteria": [
        "If profile fetch fails while authenticated, the UI displays an error state with a visible retry action instead of remaining on an indefinite spinner.",
        "Retrying after a failure successfully re-attempts the profile fetch and proceeds to the correct route (dashboard or onboarding) when the backend responds.",
        "Console errors may exist for debugging, but the UI must not remain blocked indefinitely."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileBootstrapError.tsx",
          "operation": "create",
          "description": "Create a small authenticated-only error screen component that explains profile loading failed and provides a Retry action (calls a provided callback). Compose using existing shadcn/ui components (e.g., Card/Button/Alert); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useProfile.ts",
          "operation": "modify",
          "description": "Ensure profile query does not swallow errors into null: propagate errors via React Query (so UI can show an error state) and expose a stable retry/refetch path. Keep retry behavior intentional (no infinite automatic retries)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire ProfileBootstrapError into AuthGate: when authenticated and profile fetch errors, render a recoverable error UI with a Retry button that triggers profile refetch and then routes to dashboard/onboarding based on the next result."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Ensure AppLayout always renders page content (including onboarding and immediately after login) and avoid full-screen blank/black states caused by layout gating conditions.",
      "acceptanceCriteria": [
        "After login, the onboarding page content renders even if the header is intentionally hidden.",
        "After login and successful profile load, dashboard content renders and navigation becomes available for onboarded users.",
        "There is no full-screen blank/black page caused by layout gating conditions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Adjust layout gating to be content-first: keep header optional (e.g., hide on onboarding), but never conditionally suppress the main content area based on auth/profile/onboarding checks. Derive header visibility from route + onboarded state without causing blank screens while profile is still loading."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure AuthGate and router/layout composition never results in a black/blank full-screen view: authenticated users should either see onboarding, an explicit error-with-retry, or the app content; unauthenticated users should see SignInScreen."
        }
      ]
    }
  ]
}