{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix My Vehicles listing consistency and improve revoke/list error states",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Scope “My Vehicles” data to the signed-in principal and ensure list refreshes after registration/account switching without cache bleed.",
      "acceptanceCriteria": [
        "If a vehicle’s owner principal equals the current signed-in principal, getUserVehicles returns it and the Vehicles page renders it.",
        "Vehicles list data is scoped to the signed-in principal (no cross-account React Query cache bleed); switching accounts cannot show another account’s cached vehicle list.",
        "After registering a vehicle successfully, navigating to “My Vehicles” shows the vehicle without requiring a hard refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useVehicles.ts",
          "operation": "modify",
          "description": "Update React Query keys for getUserVehicles/register/revoke invalidation to be principal-scoped (e.g., include current identity principal in the query key) so cached vehicle lists cannot bleed across account switches; ensure post-register and post-revoke invalidation targets the correct principal-scoped key."
        },
        {
          "path": "frontend/src/pages/VehiclesPage.tsx",
          "operation": "modify",
          "description": "Adjust VehiclesPage to use the updated principal-scoped vehicle list hook behavior (no route changes) and ensure the UI updates correctly after navigation from registration without requiring a hard refresh."
        },
        {
          "path": "frontend/src/pages/RevokeOwnershipPage.tsx",
          "operation": "modify",
          "description": "Ensure RevokeOwnershipPage reads from the same principal-scoped vehicle list query and that successful revocation results in consistent list refresh for the signed-in principal (no route changes)."
        },
        {
          "path": "frontend/src/pages/__tests__/VehiclesPage.fetch-flow.test.tsx",
          "operation": "modify",
          "description": "Add/extend a minimal test to guard against regressions where VehiclesPage could render stale vehicles across identity changes (e.g., by asserting query key scoping behavior via mocked hooks)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add minimal, safe error states (English) for “My Vehicles” and “Revoke Ownership” so failures are visible and actionable.",
      "acceptanceCriteria": [
        "VehiclesPage shows a clear error state when getUserVehicles fails (instead of rendering as empty/undefined data).",
        "RevokeOwnershipPage shows a clear error state when getUserVehicles fails and shows the backend error message (normalized) when revoke fails.",
        "All new/updated user-facing strings for these new error states are in English.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VehiclesPage.tsx",
          "operation": "modify",
          "description": "Add an explicit error UI state when getUserVehicles fails (e.g., error card/alert with Retry action) using normalizeActorError to present a clear English message instead of falling back to an empty list."
        },
        {
          "path": "frontend/src/pages/RevokeOwnershipPage.tsx",
          "operation": "modify",
          "description": "Add an explicit error UI state when getUserVehicles fails (with retry) and normalize/display revoke failures in English (use normalizeActorError so toast and any inline message avoid generic wording and show the most relevant backend-provided message)."
        },
        {
          "path": "frontend/src/hooks/useVehicles.ts",
          "operation": "modify",
          "description": "Adjust getUserVehicles query function behavior to avoid silently returning an empty array on actor unavailability and to surface errors correctly to the pages’ error states (keep changes tightly scoped to vehicle listing and revoke flows)."
        }
      ]
    }
  ]
}