{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend rebuild trigger and startup retry robustness for IC0508 recovery",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Make a no-feature-change frontend update to trigger a fresh build/deploy and ensure the unauthenticated Sign In screen renders cleanly after redeploy.",
      "acceptanceCriteria": [
        "A new build and deployment completes successfully.",
        "After deployment, opening the app no longer fails with replica rejection IC0508 / \"Canister ... is stopped\" during startup initialization.",
        "The app renders past the startup screen and shows the expected Sign In screen for unauthenticated users."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Apply a minimal, non-functional markup update (e.g., update document language/meta description to English) to force a rebuild/redeploy and align non-visible metadata with the English-only user-facing text constraint."
        },
        {
          "path": "frontend/src/components/auth/SignInScreen.tsx",
          "operation": "modify",
          "description": "Update all user-facing strings on the Sign In screen to English (keep layout/behavior unchanged) so post-redeploy unauthenticated users see an English Sign In screen as expected."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Harden the startup retry flow so 'Retry Connection' always performs a fresh actor initialization attempt and the UI does not get stuck on an indefinite loading state.",
      "acceptanceCriteria": [
        "If actor initialization fails, the Startup Bootstrap Error screen is shown (not a blank screen).",
        "Clicking 'Retry Connection' triggers a fresh initialization attempt and either recovers to normal app flow or re-shows an error screen with the latest error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorBootstrapStatus.ts",
          "operation": "modify",
          "description": "Improve the retry mechanism to guarantee a fresh initialization attempt (e.g., cancel any in-flight actor query, clear/remove the cached actor query for the current identity key, then refetch) and expose a reliable 'isLoading' signal for retry-in-progress UI."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the improved bootstrap status into the AuthGate so the StartupBootstrapError receives/loading state for retries and the gate transitions cleanly between error ↔ retrying ↔ recovered without leaving the UI on an indefinite spinner."
        },
        {
          "path": "frontend/src/components/auth/StartupBootstrapError.tsx",
          "operation": "modify",
          "description": "Enhance the error screen UX to reflect retry-in-progress (disable button/show loading label) and ensure it continues to display the latest error message after failed retries. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}