{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix profile loading/onboarding gating, add Profile logout + principal display, and harden admin bootstrap/nav visibility",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Load caller profile from backend and fix auth/onboarding gating so onboarded users are not forced into onboarding and Profile reliably works after sign-in.",
      "acceptanceCriteria": [
        "When a user is signed in and has already completed onboarding, the app does not redirect them to the onboarding page.",
        "The frontend `useGetCallerUserProfile` hook fetches the current caller profile from the backend (instead of always returning `null`).",
        "The Profile page can be opened at route `/profile` after sign-in and displays the correct user profile data (full name, email, city, country) sourced from the backend.",
        "If the backend returns that the user is not onboarded / no profile exists, the app routes the user to onboarding as it does today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface typing to include the backend capability for fetching the current caller user profile (and any related profile capability required by the updated hook)."
        },
        {
          "path": "frontend/src/hooks/useProfile.ts",
          "operation": "modify",
          "description": "Implement `useGetCallerUserProfile` to call the backend capability to fetch the current caller profile via React Query (enabled only when the actor is available) and return a loading/fetched state that prevents onboarding flash; align with the authorization component’s recommended pattern. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust AuthGate routing logic so onboarding redirection happens only after the caller profile query is fetched, and only when the backend indicates no profile or not onboarded; ensure signed-in + onboarded users are never redirected to onboarding."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Load and render the signed-in user’s profile fields (full name, email, city, country) using `useGetCallerUserProfile`, with a safe loading/empty state; if the backend indicates no profile/not onboarded, route the user to onboarding instead of rendering invalid content."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add a Logout button on the Profile page that logs out of Internet Identity and clears cached app state.",
      "acceptanceCriteria": [
        "The Profile page contains a clearly labeled \"Logout\" button.",
        "Clicking \"Logout\" calls the existing Internet Identity logout/clear logic and clears React Query cache (consistent with the existing header logout behavior).",
        "After logout, the user is returned to the signed-out experience (SignIn screen) and protected routes are not accessible until signing in again."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled \"Logout\" button that reuses the existing Internet Identity `clear()` flow and clears React Query cache (same behavior as the header); after logout, ensure navigation returns to the signed-out experience and protected routes are inaccessible until sign-in again. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Show the signed-in user’s Internet Identity Principal ID on the Profile page as read-only text with a safe fallback state.",
      "acceptanceCriteria": [
        "The Profile page shows a read-only \"Principal ID\" field populated from the current identity principal string.",
        "If the identity is temporarily unavailable, the UI shows an appropriate fallback state (e.g., empty state or loading) without crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure the Profile page includes a read-only \"Principal ID\" field sourced from the current Internet Identity principal string, and add a non-crashing fallback (e.g., placeholder or loading state) when identity is temporarily unavailable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update the admin bootstrap UI to use explicit backend checks/claim methods so first-admin claiming and immediate admin access works reliably.",
      "acceptanceCriteria": [
        "Backend exposes an explicit way to determine whether \"first admin\" can be claimed (based on whether any admin exists), rather than relying on guessing via unauthorized errors from admin-only APIs.",
        "Backend exposes a dedicated method to claim first admin that assigns the admin role to the caller only when no admin exists; otherwise it must fail safely.",
        "Frontend AccessDeniedScreen uses the new backend capability check and claim method to show a \"Claim admin access\" action only when it is truly available.",
        "After successfully claiming admin, the Admin navigation entry becomes visible without a full refresh, and `/admin` becomes accessible to the claimant immediately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend frontend typing to reflect the new backend capabilities for (1) checking whether first-admin can be claimed and (2) claiming first-admin, so hooks and UI can call them safely."
        },
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "modify",
          "description": "Replace the current first-admin detection (guessing via unauthorized errors) with explicit backend capability calls; update the claim mutation to call the dedicated claim method (no direct role assignment via private actor identity), and invalidate/refetch admin-related queries on success so UI updates immediately. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update AccessDeniedScreen to use the new hooks based on explicit backend first-admin availability/claim capabilities; show \"Claim admin access\" only when available, and on success ensure navigation and cached admin state updates so Admin menu and `/admin` access are immediate."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Make Admin navigation visibility consistent (desktop/mobile) based on backend admin check and ensure `/admin` route behaves correctly for admins vs non-admins.",
      "acceptanceCriteria": [
        "When the signed-in principal is an admin, the header shows an \"Admin\" navigation entry in both desktop and mobile menus.",
        "When the signed-in principal is not an admin, the \"Admin\" navigation entry is not shown.",
        "Navigating to `/admin` as an admin successfully renders the admin dashboard page; navigating as a non-admin shows an access denied experience."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "modify",
          "description": "Ensure the admin-check query remains the single source of truth for admin UI visibility and is invalidated/refetched after any successful admin-claim flow so navigation updates without refresh."
        },
        {
          "path": "frontend/src/components/nav/AppHeader.tsx",
          "operation": "modify",
          "description": "Confirm Admin navigation entry rendering is driven by the admin-check hook for both desktop and mobile menus, and adjust if needed so it reliably appears/disappears based on backend admin status (including immediately after claim)."
        }
      ]
    }
  ]
}