{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin activation status display for vehicle registration",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update frontend activation-status querying so the allowlist admin principal is treated as activated and Profile/Vehicles pages reflect it without changing existing flows.",
      "acceptanceCriteria": [
        "When logged in as the allowlist admin principal, the Profile page activation card shows 'Activated' (not 'Not Activated') and does not show the activation-token redeem form.",
        "When logged in as the allowlist admin principal, Vehicles page treats the account as activated (shows the 'Register Vehicle' primary action rather than 'Activate to Register').",
        "For non-admin users, activation UI/behavior remains unchanged (still shows 'Not Activated' when userActivations is false/missing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useVehicleRegistrationActivation.ts",
          "operation": "modify",
          "description": "Adjust the activation-status query to be identity-aware and to treat the allowlist admin principal as activated by first verifying allowlist-admin status (using the backend capability isAllowlistAdmin and the client-side allowlist helper) before falling back to the existing isCallerActivatedForVehicleRegistration call. Ensure the React Query key includes the caller principal so cached activation state does not leak across sessions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Confirm the Profile page continues to rely on the centralized activation hook result only (no new UI flows) so that once the activation hook returns true for allowlist admin, the VehicleRegistrationActivationCard renders the Activated state and hides the redeem form as-is. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/VehiclesPage.tsx",
          "operation": "modify",
          "description": "Confirm the Vehicles page continues to use the centralized activation hook result only so that allowlist admin sees the existing 'Register Vehicle' primary action without changing any registration/activation UI logic for normal users. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}