{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allowlisted admin onboarding bypass and routing guard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Expand the client-side admin allowlist to support multiple principals and treat the specified principal as admin for onboarding-bypass checks.",
      "acceptanceCriteria": [
        "`isAllowlistedAdmin(...)` returns true for `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`.",
        "Allowlist logic is not limited to a single hardcoded string (e.g., uses a list/array/set internally)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/adminAllowlist.ts",
          "operation": "modify",
          "description": "Refactor the allowlist to be backed by a collection (e.g., Set/array) that can hold multiple principals without code churn; ensure `isAllowlistedAdmin` checks membership and includes `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae` exactly, and keep a helper to retrieve the allowlist for future growth."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent admins (including allowlisted admin) from being forced into onboarding/registration and guard /onboarding from admin completion.",
      "acceptanceCriteria": [
        "When logged in as `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`, the app does not navigate to `/onboarding` automatically.",
        "If the user manually visits `/onboarding` while already recognized as admin, the app prevents completing the invite-based onboarding flow and instead routes them back to a main page (e.g., dashboard/admin).",
        "Admin navigation (e.g., the Admin link) is accessible for the allowlisted/admin principal without completing onboarding."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routes/RootRouteGate.tsx",
          "operation": "modify",
          "description": "Update the bootstrap redirect logic to treat any authenticated admin as exempt from onboarding redirects: use the existing admin-check hook (built on the authorization component’s admin checks) to determine admin status (including allowlisted admin) and skip navigation to `/onboarding` when admin=true even if `getCallerUserProfile()` is null. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/OnboardingInvitePage.tsx",
          "operation": "modify",
          "description": "Add an admin guard so that if an authenticated user is already recognized as admin (including allowlisted admin), the page immediately routes them away (e.g., to `/admin` or `/`) and blocks form submission; any new/modified user-facing messages introduced here must be in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/nav/AppHeader.tsx",
          "operation": "modify",
          "description": "Ensure admin navigation remains available for admin users even when no profile exists by relying on the admin-check hook state (and not on profile presence) for showing the Admin link; keep behavior consistent for allowlisted admin. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}