{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "IC canister-deployed app experiencing production backend canister stoppage (IC0508) requiring force redeploy/reinstall, and an admin access/onboarding issue caused by a hardcoded frontend admin principal allowlist; user wants their current principal to be recognized as admin and bypass onboarding.",
  "architectural_notes": [
    "Frontend admin bypass/onboarding is controlled by a hardcoded principal allowlist in `frontend/src/utils/adminAllowlist.ts` (currently only one principal is treated as admin).",
    "IC deployment context: separate frontend and backend canisters; backend stoppage (IC0508) breaks the app regardless of frontend/browser state."
  ],
  "known_issues": [
    "Production backend canister can become STOPPED (IC0508), requiring forced start or full reinstall/redeploy; potential cycles exhaustion mentioned as a cause.",
    "Admin users may be redirected to onboarding/registration if their principal does not match the hardcoded frontend admin allowlist."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-client-side-admin-allowlist-so-the-user-s-internet-identity-principal-dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae-is-treated-as-an-admin-for-onboarding-bypass-checks-and-structure-the-allowlist-so-it-can-support-more-than-one-principal-without-code-churn",
      "title": "Update the client-side admin allowlist so the user’s Internet Identity principal `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae` is treated as an admin for onboarding-bypass checks (and structure the allowlist so it can support more than one principal without code churn).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-change-routing-bootstrap-behavior-so-an-admin-user-is-never-forced-into-the-onboarding-registration-flow-specifically-when-the-authenticated-principal-is-admin-including-the-allowlisted-admin-do-not-redirect-to-onboarding-even-if-getcalleruserprofile-returns-null-and-ensure-the-app-lands-on-a-usable-authenticated-route-e-g-or-admin-without-showing-the-onboarding-form",
      "title": "Change routing/bootstrap behavior so an admin user is never forced into the onboarding/registration flow. Specifically: when the authenticated principal is admin (including the allowlisted admin), do not redirect to `/onboarding` even if `getCallerUserProfile()` returns `null`, and ensure the app lands on a usable authenticated route (e.g., `/` or `/admin`) without showing the onboarding form.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update admin authorization so the user's current Internet Identity principal is recognized as admin (e.g., add principal to frontend admin allowlist to bypass onboarding).",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Remove/replace hardcoded frontend admin allowlist so admin status is determined by backend roles instead of a single hardcoded principal.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Update backend authorization so the allowlisted admin principal can be treated as an admin immediately (without requiring onboarding/profile completion), enabling admin APIs that currently rely on `hasAdminPermission` and preventing the ‘admin must register’ dead-end after a reinstall. Keep the allowlisted admin principal value exactly as `dcama-lvxhu-qf6zb-u75wm-yapdd-dosl4-b3rvi-pxrax-sznjy-3yq47-bae`.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Make the current Internet Identity principal an admin and bypass onboarding/registration",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}