{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "User signup/onboarding flow should not require admin authorization for normal end-users (only for admin-specific actions/roles)."
  ],
  "known_issues": [
    "User account onboarding still prompts for admin authorization even though registration should be simplified."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-frontend-onboarding-error-handling-so-that-if-the-backend-still-returns-an-authorization-related-onboarding-failure-the-onboarding-ui-shows-a-clear-english-message-explaining-registration-could-not-be-completed-without-mentioning-admin-role-assignment-and-does-not-display-the-raw-backend-error-string-to-end-users",
      "title": "Update the frontend onboarding error handling so that if the backend still returns an authorization-related onboarding failure, the onboarding UI shows a clear English message explaining registration could not be completed (without mentioning admin role assignment), and does not display the raw backend error string to end users.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Permudah pendaftaran akun pengguna: hilangkan/skip permintaan authorize ke admin saat user signup/onboarding",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix backend onboarding so a normal user completing onboarding with a valid invite token can be assigned the `#user` role without requiring admin privileges, and without trapping with the error `Unauthorized: Only admins can assign user roles`. Keep the existing behavior for the allowlisted first-admin claim (allowlisted principal can complete onboarding with an empty token).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix user onboarding so registration does not require admin authorization",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}